/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 80011
Source Host           : localhost:3306
Source Database       : comany_credit

Target Server Type    : MYSQL
Target Server Version : 80011
File Encoding         : 65001

Date: 2020-06-07 18:13:03
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for comment
-- ----------------------------
DROP TABLE IF EXISTS `comment`;
CREATE TABLE `comment` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(255) DEFAULT NULL,
  `conent` varchar(255) DEFAULT NULL,
  `date` datetime DEFAULT NULL,
  `nickname` varchar(255) DEFAULT NULL,
  `sumup` varchar(255) DEFAULT NULL,
  `sumdown` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT '',
  `company` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of comment
-- ----------------------------
INSERT INTO `comment` VALUES ('2', 'admin', '该公司股价长期稳定，值得购入', '2020-01-01 00:00:00', '雨季不再来', '56', '12', '腾讯控股');
INSERT INTO `comment` VALUES ('3', 'admin', '水水水水', '2020-02-01 00:00:00', '雨季不再来', '56', '12', '腾讯控股');
INSERT INTO `comment` VALUES ('4', 'admin', '22222222222', '2020-05-04 00:00:00', '雨季不再来', '0', '0', '腾讯控股');
INSERT INTO `comment` VALUES ('9', 'admin', '测试增加评论', '2020-05-23 10:00:51', '雨季不再来', '0', '0', '腾讯控股');
INSERT INTO `comment` VALUES ('11', 'admin', '测试评论2', '2020-05-23 10:07:17', '张三', '0', '0', '腾讯控股');
INSERT INTO `comment` VALUES ('13', 'admin', '删除评论测试', '2020-05-23 10:07:43', '张三', '0', '0', '腾讯控股');
INSERT INTO `comment` VALUES ('15', 'admin', '企业评价测试', '2020-05-23 10:08:36', '张三', '0', '0', '腾讯控股');
INSERT INTO `comment` VALUES ('16', 'admin', '测试评论', '2020-05-23 10:15:56', '雨季不再来', '0', '0', '腾讯控股');
INSERT INTO `comment` VALUES ('18', 'admin', '测试数据', '2020-05-23 12:17:36', '雨季不再来', '0', '0', '腾讯控股');

-- ----------------------------
-- Table structure for company
-- ----------------------------
DROP TABLE IF EXISTS `company`;
CREATE TABLE `company` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `name` varchar(128) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '公司名',
  `representative` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '法人代表',
  `address` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '公司地址',
  `region` varchar(15) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '所属地区(省)',
  `city` varchar(15) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '城市',
  `district` varchar(15) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '区/县',
  `lat_long` varchar(80) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '经纬度，json -> {"lat": "30.18484477830133", "long": "120.06383340659741"}',
  `biz_status` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '经营状态',
  `credit_code` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '统一社会信用代码',
  `register_code` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '注册号',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '电话',
  `email` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '邮箱',
  `setup_time` varchar(20) DEFAULT '-' COMMENT '成立时间',
  `industry` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '所属行业',
  `biz_scope` varchar(1200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '经营范围',
  `company_type` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '公司类型',
  `registered_capital` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '注册资本',
  `actual_capital` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '实缴资本',
  `taxpayer_code` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '纳税人识别号',
  `organization_code` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '组织机构代码',
  `english_name` varchar(128) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '公司英文名',
  `authorization` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '登记机关',
  `homepage` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '公司官网',
  `used_name` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '公司曾用名',
  `search_key` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '-' COMMENT '搜索关键字',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '插入时间',
  `modify_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '最后操作时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `uq_credit_reg_code` (`credit_code`,`register_code`)
) ENGINE=InnoDB AUTO_INCREMENT=105 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='企业信息表';

-- ----------------------------
-- Records of company
-- ----------------------------
INSERT INTO `company` VALUES ('1', '腾讯科技（北京）有限公司', '奚丹', '北京市海淀区海淀大街38号银科大厦16层1601-1608室', '北京', '北京市', '海淀区', '{\'lat\': 39.987927696738105, \'long\': 116.31284058342716}', '在业', '91110108772551611J', '110000410244650', '010-62671188', 'winama@tencent.com', '2005-03-30', '软件和信息技术服务业', '计算机软硬件的技术开发;销售自行开发的软件;并提供相关的技术服务和信息服务;经营设计;制作;发布;代理国内外各类广告业务;移动电信;宽带网络的技术服务;教育咨询', '有限责任公司港、澳、台', '160万美元', '100万美元', '91110108772551611J', '772551611', 'Tencent Technology(Beijing)Co.,Ltd.', '北京市工商行政管理局海淀分局', 'www.tencent.com', '-', '腾讯', '2020-04-03 17:04:46', '2020-04-03 17:04:46');
INSERT INTO `company` VALUES ('2', '深圳市腾讯计算机系统有限公司', '马化腾', '深圳市南山区粤海街道麻岭社区科技中一路腾讯大厦35层', '广东', '深圳市', '南山区', '{\'lat\': 22.553119590055715, \'long\': 113.9507035606987}', '存续', '91440300708461136T', '440301103448669', '0755-86013388', 'landyzhang@tencent.com', '1998-11-11', '软件和信息技术服务业', '计算机软;硬件的设计;技术开发;销售;数据库及计算机网络服务;国内商业;物资供销业;从事广告业务;另行办理审批登记后方可经营;货物及技术进出口;票务代理;第一类增值电信业务中的国内互联网虚拟专用网业务;第二类增值电信业务中的国内多方通信服务业务;国内呼叫中心业务;信息服务业务;网络游戏出版运营;...出版物零售', '有限责任公司', '6500万人民币', '6500万人民币', '91440300708461136T', '708461136', 'Shenzhen Tencent Computer Systems Company Limited', '深圳市市场监督管理局', 'www.qq.com', '-', '腾讯', '2020-04-03 17:04:48', '2020-04-03 17:04:48');
INSERT INTO `company` VALUES ('3', '腾讯科技（深圳）有限公司', '马化腾', '深圳市南山区高新区科技中一路腾讯大厦35层', '广东', '深圳市', '南山区', '{\'lat\': 22.553119590055715, \'long\': 113.9507035606987}', '存续', '9144030071526726XG', '440301503270924', '0755-86013388', 'landyzhang@tencent.com', '2000-02-24', '软件和信息技术服务业', '从事计算机软硬件的技术开发;销售自行开发的软件;计算机技术服务及信息服务;计算机硬件的研发;批发;玩具设计开发;玩具的批发与零售;商品的批发与零售;动漫及衍生产品设计服务;电子产品设计服务;游戏游艺设备销售;国内贸易;从事货物及技术进出口;一类医疗器械销售;二类医疗器械销售;以上项目不涉及外商投资...三类医疗器械销售', '有限责任公司港、澳、台', '200万美元', '200万美元', '9144030071526726XG', '71526726X', 'Tencent Technology(Shenzhen)Co.,Ltd.', '南山局', 'www.hudongcdn.com', '-', '腾讯', '2020-04-03 17:04:51', '2020-04-03 17:04:51');
INSERT INTO `company` VALUES ('4', '腾讯科技（上海）有限公司', '奚丹', '上海市徐汇区虹梅路1801号C区五层', '上海', '上海市', '徐汇区', '{\'lat\': 31.17418588439909, \'long\': 121.4048640768966}', '存续', '913100006778230255', '310000400579554', '021-54569595', 'larissaluo@tencent.com', '2008-07-23', '软件和信息技术服务业', '开发;设计;制作计算机软件;销售自产的产品;并提供相关的技术咨询和技术服务;从事货物及技术的进出口业务', '有限责任公司港、澳、台', '500万美元', '-', '913100006778230255', '677823025', 'Tencent Technology(Shanghai)Company Limited', '上海市工商行政管理局', 'www.qq.com', '-', '腾讯', '2020-04-03 17:04:54', '2020-04-03 17:04:54');
INSERT INTO `company` VALUES ('5', '腾讯数码（天津）有限公司', '卢山', '天津开发区信环南街9号', '天津', '天津市', '西青区', '{\'lat\': 39.04595239667812, \'long\': 117.69527203783076}', '存续', '911201167576023883', '120000400024501', '66227766', 'sophiewang@tencent.com', '2004-02-08', '软件和信息技术服务业', '从事计算机软硬件的技术开发;销售自行开发的软件;计算机技术服务及信息服务;提供相关的技术咨询服务', '有限责任公司港、澳、台', '9000万美元', '9000万美元', '911201167576023883', '757602388', '-', '天津市滨海新区市场监督管理局', null, '-', '腾讯', '2020-04-03 17:04:56', '2020-04-03 17:04:56');
INSERT INTO `company` VALUES ('6', '腾讯科技（成都）有限公司', '奚丹', '四川省中国（四川）自由贸易试验区四川省成都市高新区天府三街198号', '四川', null, null, '{\'lat\': 30.553812313126024, \'long\': 104.06839324205187}', '存续', '915101006771521538', '510100400024413', '', 'v_joshwang@tencent.com', '2008-07-10', '软件和信息技术服务业', '从事计算机软硬件技术开发;提供相关技术及信息服务;自有房屋租赁;纺织服装及日用品的批发与零售;货物及技术的进出口;广告;画册及相关产品的设计;销售;批发;零售定型包装食品;保健食品;基础软件服务;技术开发;技术咨询;技术服务;技术转让;软件开发;软件设计;机器人的研发;...涉及国家规定实施准入特别管理措施的除外', '有限责任公司港、澳、台', '22000万美元', '-', '915101006771521538', '677152153', 'Tencent Technology(Chengdu)Co.,Ltd.', '成都市市场监督管理局', 'www.tencent.com', '-', '腾讯', '2020-04-03 17:04:59', '2020-04-03 17:04:59');
INSERT INTO `company` VALUES ('7', '淮安腾讯广告有限公司', '姚海华', '淮阴区南昌北路9号（淮阴软件科技产业园A8楼三层）', '江苏', '淮安市', '淮阴区', '{\'lat\': 33.62183225462662, \'long\': 119.06830224897051}', '在业', '91320804056651259C', '320804000099733', '13382331233', '1145849470@qq.com', '2012-11-13', '商务服务业', '国内广告设计;制作;代理;发布;营销策划;礼仪庆典服务;企业管理咨询服务;软件开发;销售;信息系统集成服务;房地产中介服务;网页设计', '有限责任公司', '50万人民币', '50万人民币', '91320804056651259C', '056651259', '-', '淮安市淮阴区市场监督管理局', null, '-', '腾讯', '2020-04-03 17:05:01', '2020-04-03 17:05:01');
INSERT INTO `company` VALUES ('8', '深圳市腾讯视频文化传播有限公司', '洪丹毅', '深圳市宝安区新安街道海旺社区宝兴路6号海纳百川总部大厦A座5层523房', '广东', '深圳市', '宝安区', '{\'lat\': 22.55492252875192, \'long\': 113.88756391218698}', '存续', '91440300311934169U', '440301111052884', '0755-86013388', 'landyzhang@tencent.com', '2014-08-11', '文化艺术业', '企业形象策划;文化活动策划;会务策划;影视项目投资;具体项目另行申报;从事广告业务', '有限责任公司', '19000万人民币', '-', '91440300311934169U', '311934169', '-', '深圳市市场监督管理局', null, '-', '腾讯', '2020-04-03 17:05:03', '2020-04-03 17:05:03');
INSERT INTO `company` VALUES ('9', '江苏金腾讯信息技术有限公司', '何学东', '宿迁市宿豫区恒山路南侧水务局东侧金莎大厦17-18楼', '江苏', '宿迁市', '宿豫区', '{\'lat\': 33.95830920681018, \'long\': 118.33703568738606}', '在业', '913213115618352353', '321300000040407', '18651903777', '19874143@qq.com', '2010-09-20', '软件和信息技术服务业', '预包装食品兼散装食品批发与零售;计算机软硬件的技术研发;网络技术咨询;技术转让及技术服务;日用百货;计算机;数码产品;机电设备;电子产品;电子系统设备;电子元器件;通讯设备;办公用品;摄影器材;体育用品;建筑材料;不锈钢制品;机械设备;服装;鞋帽;钟表;眼镜;花卉;制冷设备;家用电器;汽车装饰用品批发与零售', '有限责任公司', '500万人民币', '500万人民币', '913213115618352353', '561835235', '-', '宿迁市宿豫区市场监督管理局', null, '-', '腾讯', '2020-04-03 17:05:06', '2020-04-03 17:05:06');
INSERT INTO `company` VALUES ('10', '林芝腾讯科技有限公司', '李朝晖', '西藏自治区林芝市巴宜区八一镇广东路58号星程酒店8103房', '西藏', '林芝市', '巴宜区', '{\'lat\': 0.0, \'long\': 0.0}', '存续', '91540400MA6T10MD6L', '540400200010455', '18628185663', 'v_joshwang@tencent.com', '2015-10-26', '科技推广和应用服务业', '计算机软硬件技术开发;销售;经济信息咨询;企业管理咨询;国内贸易;投资兴办实业', '有限责任公司', '10000万人民币', '1000万', '91540400MA6T10MD6L', 'MA6T10MD6', '-', '林芝市市场监督管理局', null, '-', '腾讯', '2020-04-03 17:05:09', '2020-04-03 17:05:09');
INSERT INTO `company` VALUES ('11', '林芝腾讯投资管理有限公司', '李朝晖', '西藏自治区林芝市巴宜区八一镇广东路58号星程酒店8103房', '西藏', '林芝市', '巴宜区', '{\'lat\': 0.0, \'long\': 0.0}', '存续', '91540400MA6T10MC8R', '540400200010447', '18628185663', 'v_joshwang@tencent.com', '2015-10-26', '商务服务业', '投资与资产管理;经济信息咨询;企业管理咨询;国内贸易;投资兴办实业', '有限责任公司', '10000万人民币', '2000万', '91540400MA6T10MC8R', 'MA6T10MC8', '-', '林芝市市场监督管理局', null, '-', '腾讯', '2020-04-03 17:05:11', '2020-04-03 17:05:11');
INSERT INTO `company` VALUES ('12', '深圳市腾讯网域计算机网络有限公司', '冯明杰', '深圳市前海深港合作区前湾一路1号A栋201室（入驻深圳市前海商务秘书有限公司）', '广东', '深圳市', '南山区', '{\'lat\': 22.527733543366242, \'long\': 113.90602103136793}', '存续', '914403002793320449', '440301103001006', '0755-86013388', 'landyzhang@tencent.com', '1997-04-28', '软件和信息技术服务业', '计算机软件技术开发;销售;网络商务;搜索引擎;网页制作;域名服务;行业信息;移动短信;网络游戏', '有限责任公司', '1001000万人民币', '1001000万人民币', '914403002793320449', '279332044', '-', '深圳市市场监督管理局', 'qqhx.qq.com', '深圳市网域计算机网络有限公司', '腾讯', '2020-04-03 17:05:13', '2020-04-03 17:05:13');
INSERT INTO `company` VALUES ('13', '腾讯数码（深圳）有限公司', '谢呼', '深圳市前海深港合作区前湾一路1号A栋201室（入驻...经营地址：深圳市南山区粤海街道科技中一路腾讯大厦35层', '广东', '深圳市', '南山区', '{\'lat\': 22.521191020913005, \'long\': 113.9097434345432}', '存续', '914403007938536006', '440301503270916', '0755-86013388', 'landyzhang@tencent.com', '2007-01-17', '软件和信息技术服务业', '计算机软硬件的开发;销售自行开发的软件;并提供相关的技术服务', '有限责任公司港、澳、台', '3000万美元', '3000万美元', '914403007938536006', '793853600', '-', '深圳市市场监督管理局', null, '-', '腾讯', '2020-04-03 17:05:16', '2020-04-03 17:05:16');
INSERT INTO `company` VALUES ('14', '深圳市腾讯产业投资基金有限公司', '李朝晖', '深圳市前海深港合作区前湾一路1号A栋201室（入驻...经营地址：深圳市南山区粤海街道科技中一路腾讯大厦36层。', '广东', '深圳市', '南山区', '{\'lat\': 22.521191020913005, \'long\': 113.9097434345432}', '存续', '91440300077536508W', '440301107865990', '0755-86013388', 'landyzhang@tencent.com', '2013-08-29', '货币金融服务', '股权投资;创业投资;受托管理股权投资及创业投资基金;投资顾问;企业管理咨询', '有限责任公司', '190000万人民币', '190000万人民币', '91440300077536508W', '077536508', '-', '深圳市市场监督管理局', null, '-', '腾讯', '2020-04-03 17:05:19', '2020-04-03 17:05:19');
INSERT INTO `company` VALUES ('15', '深圳市腾讯产业创投有限公司', '沈丹', '深圳市南山区粤海街道麻岭社区科技中一路腾讯大厦35层', '广东', '深圳市', '南山区', '{\'lat\': 22.553119590055715, \'long\': 113.9507035606987}', '存续', '91440300MA5FTFYU03', '440300208066007', '', '', '2019-09-17', '商务服务业', '创业投资;企业管理咨询;投资咨询', '有限责任公司', '60000万人民币', '', '91440300MA5FTFYU03', 'MA5FTFYU0', '-', '深圳市市场监督管理局', null, '-', '腾讯', '2020-04-03 17:05:21', '2020-04-03 17:05:21');
INSERT INTO `company` VALUES ('16', '上海腾讯电力工程有限公司', '丁磊磊', '上海市杨浦区沧州路138号303－2室', '上海', '上海市', '杨浦区', '{\'lat\': 31.29017185753083, \'long\': 121.53427261491763}', '存续', '913101107800063818', '310110000372531', '021-55388812', 'tony_tgj@163.com', '2005-09-05', '建筑安装业', '承装承修电力设施;送变电设备材料的销售;送变电工程领域内的技术服务;技术开发;非标准钢构件的制作;安装;市政工程施工;建筑施工;绿化施工;室内外装修装饰工程施工;劳务服务;电机设备安装;电力专业建设工程设计;电力专业建设工程咨询', '有限责任公司', '4100万人民币', '4100万人民币', '913101107800063818', '780006381', '-', '杨浦区市场监管局', null, '-', '腾讯', '2020-04-03 17:05:24', '2020-04-03 17:05:24');
INSERT INTO `company` VALUES ('17', '深圳市腾讯信达有限合伙企业（有限合伙）', '深圳市腾讯博远科技有限公司', '深圳市南山区粤海街道科技中一路腾讯大厦36层', '广东', '深圳市', '南山区', '{\'lat\': 22.553119590055715, \'long\': 113.9507035606987}', '存续', '91440300MA5ENQ5K0C', '440300202070353', '0755-86013388', 'landyzhang@tencent.com', '2017-08-09', '资本市场服务', '实业投资;创业投资', '有限合伙', '-', '-', '91440300MA5ENQ5K0C', 'MA5ENQ5K0', '-', '南山局', null, '-', '腾讯', '2020-04-03 17:05:27', '2020-04-03 17:05:27');
INSERT INTO `company` VALUES ('18', '天津腾讯网络技术有限公司', '姚星', '天津滨海高新区塘沽海洋科技园信安创业广场1号楼318号D1', '天津', '天津市', '滨海新区', '{\'lat\': 39.070982084213654, \'long\': 117.62678801049711}', '存续', '91120116MA06YC8L3T', '-', '', '', '2020-03-16', '科技推广和应用服务业', '技术服务;技术开发;技术咨询;技术交流;技术转让;技术推广;计算机及通讯设备租赁;数据处理和存储支持服务;信息技术咨询服务;凭营业执照依法自主开展经营活动', '有限责任公司', '20000万人民币', '', '91120116MA06YC8L3T', 'MA06YC8L3', '-', '天津市滨海新区市场监督管理局', null, '-', '腾讯', '2020-04-03 17:05:29', '2020-04-03 17:05:29');
INSERT INTO `company` VALUES ('19', '深圳市人保腾讯麦盛能源投资基金企业（有限合伙）', '深圳市保腾盛基金管理有限公司', '深圳市前海深港合作区前湾一路1号A栋201室（入驻深圳市前海商务秘书有限公司）', '广东', '深圳市', '南山区', '{\'lat\': 22.521191020913005, \'long\': 113.9097434345432}', '存续', '914403005930447881', '440305602302004', '0755-21846590', '1052534068@qq.com', '2012-03-20', '资本市场服务', '股权投资;项目投资;投资管理;受托资产管理;投资咨询;企业投资顾问;企业管理咨询;经济信息咨询;国内贸易', '有限合伙', '1000000万人民币', '-', '914403005930447881', '593044788', '-', '南山局', null, '深圳高端装备投资基金企业（有限合伙\n深圳前海高端装备投资基金企业（有限合伙）\n深圳前海高端装备投资基金企业（有限合伙\n深圳高端装备投资基金企业（有限合伙）', '腾讯', '2020-04-03 17:05:32', '2020-04-03 17:05:32');
INSERT INTO `company` VALUES ('20', '仪征腾讯数码有限公司', '钟远河', '仪征市经济开发区闽泰大道西侧-1', '江苏', '扬州市', '仪征市', '{\'lat\': 32.2669794192003, \'long\': 119.24962803234733}', '在业', '91321081MA1X8WKU21', '-', '025-83507292', 'v_lucywu@tencent.com', '2018-09-28', '软件和信息技术服务业', '计算机设备制造;计算机技术开发;技术服务;服务器租赁;软件开发;数据处理和存储服务;信息技术咨询服务', '有限责任公司', '10000万人民币', '10000万人民币', '91321081MA1X8WKU21', 'MA1X8WKU2', '-', '仪征市市场监督管理局', null, '-', '腾讯', '2020-04-03 17:05:35', '2020-04-03 17:05:35');
INSERT INTO `company` VALUES ('21', '阿里巴巴（中国）网络技术有限公司', '戴珊', '浙江省杭州市滨江区网商路699号', '浙江', '杭州市', '滨江区', '{\'lat\': 30.195682032617448, \'long\': 120.19867692965084}', '存续', '91330100716105852F', '330100400015575', '0571-85022088', 'shizhou.fsz@alibaba-inc.com', '1999-09-09', '软件和信息技术服务业', '开发;销售计算机网络应用软件;设计;制作;加工计算机网络产品并提供相关技术服务和咨询服务;服务;自有物业租赁;翻译;成年人的非证书劳动职业技能培训', '有限责任公司港、澳、台', '1072526万美元', '322164万美元', '91330100716105852F', '716105852', 'Alibaba(China)Technology Co.,Ltd.', '杭州市高新区（滨江）市场监督管理局', 'www.aliimg.com', '-', '阿里巴巴', '2020-04-03 17:09:53', '2020-04-03 20:12:08');
INSERT INTO `company` VALUES ('22', '北京阿里巴巴云计算技术有限公司', '任庚', '北京市海淀区学院南路55号1号楼13层20号', '北京', '北京市', '海淀区', '{\'lat\': 39.96364342955385, \'long\': 116.3411699951426}', '在业', '91110108797550447Q', '110000410305210', '0571-85022088', 'gsll@service.alibaba.com', '2006-12-28', '科技推广和应用服务业', '研究;开发计算机软件;互联网技术;数据信息处理;存储;传输技术;系统集成;提供技术咨询;技术转让;技术服务;销售自行开发的产品', '有限责任公司港、澳、台', '35万美元', '35万美元', '91110108797550447Q', '797550447', 'Beijing Alibaba Cloud Computing Technology Co.,Ltd.', '北京市工商行政管理局海淀分局', 'www.nic.xin', '融慧信通国际信息技术（北京）有限公司', '阿里巴巴', '2020-04-03 17:09:56', '2020-04-03 20:12:11');
INSERT INTO `company` VALUES ('23', '淘宝（中国）软件有限公司', '张勇', '浙江省杭州市余杭区五常街道文一西路969号3幢5层554室', '浙江', '杭州市', '余杭区', '{\'lat\': 30.286304090822593, \'long\': 120.03000646890875}', '存续', '913301007682254698', '330100400015044', '0571-85022088', 'gsll@service.alibaba.com', '2004-12-07', '软件和信息技术服务业', '研究;开发计算机软;硬件;网络技术产品;多媒体产品;系统集成的设计;调试及维护;销售自身开发的产品;并提供计算机技术咨询;服务;电子商务平台支持;经济信息咨询;含商品中介', '有限责任公司港、澳、台', '37500万美元', '37500万美元', '913301007682254698', '768225469', 'Tao Bao(China)Software Co.,Ltd.', '杭州市余杭区市场监督管理局', 'www.taobao.org', '-', '阿里巴巴', '2020-04-03 17:09:59', '2020-04-03 20:12:13');
INSERT INTO `company` VALUES ('24', '阿里巴巴（中国）有限公司', '张勇', '浙江省杭州市滨江区长河街道网商路699号4号楼5楼508室', '浙江', '杭州市', '滨江区', '{\'lat\': 30.195682032617448, \'long\': 120.19867692965084}', '存续', '91330100799655058B', '330100400013364', '0571-85022088', 'gsll@service.alibaba.com', '2007-03-26', '商务服务业', '服务;计算机系统服务;电脑动画设计;经济信息咨询服务;成年人的非证书劳动职业技能培训和成年人的非文化教育培训;生产;计算机软件;销售自产产品', '有限责任公司港、澳、台', '15298万美元', '15298万美元', '91330100799655058B', '799655058', 'Alibaba(China)Co.,Ltd.', '杭州市高新区（滨江）市场监督管理局', 'www.aliway.com', '浙江阿里巴巴企业管理咨询有限公司', '阿里巴巴', '2020-04-03 17:10:01', '2020-04-03 20:12:16');
INSERT INTO `company` VALUES ('25', '阿里巴巴（湖北）有限公司', '钱猛', '武昌区中北路9号长城汇T2号写字楼第31层一室16号', '湖北', '武汉市', '武昌区', '{\'lat\': 30.555851834387674, \'long\': 114.34499690275358}', '存续', '91420106MA49B30P5P', '-', '', '', '2019-09-19', '科技推广和应用服务业', '网络信息技术推广服务;技术咨询;通信及多媒体技术研发;计算机网络系统工程技术服务;计算机技术开发;技术服务;计算机信息安全产品;电子产品设计;计算机及辅助设备维修;信息系统集成服务;信息技术咨询服务;信息电子技术服务;软件技术推广服务;科技中介服务', '有限责任公司', '10000万人民币', '', '91420106MA49B30P5P', 'MA49B30P5', '-', '武汉市武昌区市场监督管理局', null, '-', '阿里巴巴', '2020-04-03 17:10:04', '2020-04-03 20:12:40');
INSERT INTO `company` VALUES ('26', '阿里巴巴（上海）有限公司', '陶雪飞', '上海市徐汇区龙腾大道2879号3楼3921室', '上海', '上海市', '徐汇区', '{\'lat\': 31.18014723010677, \'long\': 121.46775494959955}', '存续', '91310104MA1FRHJC59', '-', '', '', '2019-07-23', '商务服务业', '从事计算机科技;计算机信息科技;智能科技;计算机网络科技;电子科技;物联网科技领域内的技术开发;技术咨询;技术转让;技术服务;计算机系统集成;计算机网络工程施工;新兴软件及服务;计算机数据处理服务;大数据服务;展览展示服务;会务服务;各类广告设计;制作;代理;发布;供应链管理;货物运输代理;仓储;...餐饮服务', '有限责任公司', '10000万人民币', '', '91310104MA1FRHJC59', 'MA1FRHJC5', '-', '徐汇区市场监督管理局', null, '-', '阿里巴巴', '2020-04-03 17:10:06', '2020-04-03 20:12:24');
INSERT INTO `company` VALUES ('27', '阿里巴巴丝路有限公司', '张建锋', '陕西省西安市高新区天谷八路528号国家电子商务示范基地东区202室', '陕西', '西安市', null, '{\'lat\': 0.0, \'long\': 0.0}', '在业', '91610131MA6UAL4458', '610131100396650', '0571-85022088', 'shizhou.fsz@alibaba-inc.com', '2017-11-24', '软件和信息技术服务业', '网络信息技术;计算机软硬件;网络技术产品;多媒体产品的研发;系统集成;计算机的技术咨询;技术服务;网站建设;电子产品的批发;零售;机械设备维修', '有限责任公司外商投资企业', '10000万人民币', '', '91610131MA6UAL4458', 'MA6UAL445', '-', '西安市工商行政管理局高新分局', null, '阿里巴巴西北有限公司', '阿里巴巴', '2020-04-03 17:10:09', '2020-04-03 20:12:29');
INSERT INTO `company` VALUES ('28', '阿里巴巴（山东）有限公司', '李然', '山东省济南市市中区二环南路新都会2号楼316室', '山东', '济南市', '市中区', '{\'lat\': 36.606357692164245, \'long\': 117.00520200947639}', '在业', '91370103MA3QLW7459', '-', '', '', '2019-09-23', '软件和信息技术服务业', '企业管理咨询服务;网络技术;计算机软硬件技术;多媒体技术开发;计算机软硬件的生产;研发;销售;计算机系统集成;计算机技术咨询服务;网络运行维护;商务信息咨询以及其他按法律', '有限责任公司', '10000万人民币', '', '91370103MA3QLW7459', 'MA3QLW745', '-', '济南市市中区市场监督管理局', null, '-', '阿里巴巴', '2020-04-03 17:10:11', '2020-04-03 20:12:19');
INSERT INTO `company` VALUES ('29', '阿里巴巴（河南）有限公司', '郅永宽', '郑州市郑东新区中道东路6号创意岛大厦D区4层D-4-006号', '河南', '郑州市', null, '{\'lat\': 34.80061896762851, \'long\': 113.81412295992759}', '存续', '91410100MA47CKY82L', '-', '', '', '2019-09-10', '软件和信息技术服务业', '网络信息技术推广服务;通信技术研究开发;计算机网络系统工程服务;计算机技术开发;技术服务;计算机信息安全产品设计;计算机和辅助设备修理;网络安全信息咨询;网络技术研究开发;多媒体设计服务;信息系统集成服务;电子产品设计服务;信息技术咨询服务;信息电子技术服务;信息系统安全服务;科技信息咨询服务;...商品信息咨询服务', '有限责任公司（非自然人投资或控股的法人独资）', '10000万人民币', '', '91410100MA47CKY82L', 'MA47CKY82', '-', '郑州市市场监督管理局郑东新区分局', null, '-', '阿里巴巴', '2020-04-03 17:10:14', '2020-04-03 20:12:32');
INSERT INTO `company` VALUES ('30', '阿里巴巴（重庆）有限公司', '李津', '重庆市北碚区云汉大道117号附66号', '重庆', '重庆市', '北碚区', '{\'lat\': 29.807846150659042, \'long\': 106.53532374866481}', '存续', '91500000MA5YUUWB6M', '500905010498638', '0571-85022088', 'gsll@service.alibaba.com', '2018-04-20', '软件和信息技术服务业', '计算机系统集成服务;会务服务;电子商务信息咨询;动漫设计;生产;研发;从事电子产品;领域内的技术开发;技术咨询;技术服务;数据处理和存储服务;供应链管理服务;物流信息咨询;计算机硬件;软件;通讯设备;及配件安装;维修;租赁;利用互联网及实体店销售;计算机软硬件;通信设备;网络设备;电子产品;数码产品;...餐饮服务', '有限责任公司外商投资企业', '10000万人民币', '', '91500000MA5YUUWB6M', 'MA5YUUWB6', '-', '重庆两江新区市场和质量监督管理局', null, '-', '阿里巴巴', '2020-04-03 17:10:17', '2020-04-03 20:12:38');
INSERT INTO `company` VALUES ('31', '阿里巴巴（江西）有限公司', '郭坤坤', '江西省南昌市红谷滩新区红角洲学府大道899号江西慧谷-红谷创意产业园1号楼A栋5楼506室', '江西', '南昌市', null, '{\'lat\': 28.665779792294142, \'long\': 115.82304754027577}', '存续', '91360125MA38LAFY5X', '360125110010384', '', '', '2019-05-20', '软件和信息技术服务业', '计算机软硬件的技术开发;技术咨询;技术服务;信息系统集成服务;会议;展览及相关服务;设计;制作;代理;发布国内各类广告;数据处理和存储服务;供应链管理服务;企业管理咨询服务;现代贸易物流服务;自营和代理各类商品及技术的进出口业务;计算机硬件;软件;通讯设备及配件安装;维修;租赁;计算机软硬件;...餐饮服务', '有限责任公司外商投资企业', '10000万人民币', '', '91360125MA38LAFY5X', 'MA38LAFY5', '-', '南昌市红谷滩新区市场和质量监督管理局', null, '-', '阿里巴巴', '2020-04-03 17:10:19', '2020-04-03 20:12:22');
INSERT INTO `company` VALUES ('32', '阿里巴巴（海南）有限公司', '李津', '海南省海口市龙华区滨海大道32号复兴城A2区3楼', '海南', '海口市', '龙华区', '{\'lat\': 20.04462052282242, \'long\': 110.32544079878336}', '存续', '91460100MA5T4AQ58Y', '460100011604883', '0571-85022088', 'gsll@service.alibaba.com', '2018-05-10', '软件和信息技术服务业', '计算机系统集成设计;调试;维护及应用服务;电脑动画设计;经济信息咨询;计算机软硬件的研发;制造;销售;设备租赁及机房租赁;电子商务平台的技术研发;建设;运营管理及技术支持;网络技术产品研发;多媒体产品研发;销售预包装食品;散装食品;乳制品;含婴幼儿配方乳粉;保健食品;食用农产品;通信产品;针纺织品;...仓储服务', '有限责任公司', '10000万人民币', '-', '91460100MA5T4AQ58Y', 'MA5T4AQ58', '-', '海口市市场监督管理局', null, '-', '阿里巴巴', '2020-04-03 17:10:22', '2020-04-03 20:12:35');
INSERT INTO `company` VALUES ('33', '阿里巴巴华东有限公司', '张建锋', '南京市建邺区白龙江东街8号新城科技园综合体2幢8层', '江苏', '南京市', '建邺区', '{\'lat\': 0.0, \'long\': 0.0}', '存续', '91320105MA1R9GM220', '320105000346188', '0571-85022088', 'gsll@service.alibaba.com', '2017-10-10', '软件和信息技术服务业', '计算机软硬件研发;计算机信息系统集成服务;电子产品的技术开发;技术咨询;技术服务;会务服务;设计;制作;代理;发布国内广告;数据处理和存储服务;供应链管理服务;企业管理咨询;物流信息咨询;自营和代理各类商品和技术的进出口业务;计算机硬件;软件;通讯设备及配件安装;维修;租赁;计算机软硬件;通信设备;...餐饮服务', '有限责任公司', '10000万人民币', '-', '91320105MA1R9GM220', 'MA1R9GM22', '-', '南京市建邺区市场监督管理局', 'www.sparenode.com', '-', '阿里巴巴', '2020-04-03 17:10:24', '2020-04-03 20:12:27');
INSERT INTO `company` VALUES ('34', '阿里巴巴信息港（江苏）有限公司', '周明', '南通市开发区中央路59号内2幢301A室', '江苏', '南通市', null, '{\'lat\': 31.927192997522166, \'long\': 120.93959060071722}', '存续', '91320691MA1W3E4N6N', '320691400001407', '0571-85022088', 'gsll@service.alibaba.com', '2018-02-06', '软件和信息技术服务业', '企业管理服务;计算机系统服务;系统集成的设计;调试及维护;电脑动画设计;经济信息咨询服务;计算机软件的生产;销售自产产品;网络商城技术;计算机软硬件;网络技术产品;多媒体产品的研发;提供计算机技术咨询;服务;电子商务平台支持;计算机设备租赁;房屋租赁;信息技术支持管理;...涉及国家规定实施准入特别管理措施的除外', '有限责任公司港、澳、台', '12000万美元', '9618万美元', '91320691MA1W3E4N6N', 'MA1W3E4N6', '-', '南通市经济技术开发区市场监督管理局', null, '-', '阿里巴巴', '2020-04-03 17:10:27', '2020-04-03 20:12:43');
INSERT INTO `company` VALUES ('35', '杭州阿里巴巴广告有限公司', '戴珊', '浙江省杭州市滨江区网商路699号1号楼5楼', '浙江', '杭州市', '滨江区', '{\'lat\': 30.195682032617448, \'long\': 120.19867692965084}', '存续', '91330108793696828A', '330108000000965', '0571-85022088', 'gsll@service.alibaba.com', '2006-12-07', '商务服务业', '国内广告设计;制作;代理;发布;技术服务;技术开发;成果转让;计算机网络技术;服务;第二类增值电信业务中的传真存储转发业务;信息服务业务;仅限互联网信息服务;会务服务;翻译;成年人的非证书劳动职业技能培训', '有限责任公司', '1000万人民币', '1000万人民币', '91330108793696828A', '793696828', 'Hangzhou Ali Baba Advertising Co.,Ltd.', '杭州市高新区（滨江）市场监督管理局', 'www.aliexpress.com', '杭州阿里巴巴信息服务有限公司', '阿里巴巴', '2020-04-03 17:10:29', '2020-04-03 20:12:46');
INSERT INTO `company` VALUES ('36', '阿里巴巴雄安技术有限公司', '张建锋', '河北省保定市容城县澳森南大街1号', '河北', '保定市', '容城县', '{\'lat\': 39.048513482434615, \'long\': 115.85954062139027}', '存续', '91130629MA09D2EG17', '130629000020886', '0571-85022088', 'gsll@service.alibaba.com', '2017-11-30', '软件和信息技术服务业', '电子;机械设备研发及租赁;系统集成的设计;调试及维护;提供计算机技术信息咨询服务;软件和信息技术服务;企业管理咨询服务;计算机软硬件;网络技术产品;多媒体产品;电子产品;数码产品的批发;零售;广告;设计;制作;代理;发布', '有限责任公司外商投资企业', '10000万人民币', '', '91130629MA09D2EG17', 'MA09D2EG1', '-', '雄安新区公共服务局', null, '-', '阿里巴巴', '2020-04-03 17:10:32', '2020-04-03 20:12:48');
INSERT INTO `company` VALUES ('37', '杭州阿里巴巴供应链管理有限公司', '汪海', '浙江省杭州市滨江区长河街道网商路699号4号楼3楼309室', '浙江', '杭州市', '滨江区', '{\'lat\': 30.195682032617448, \'long\': 120.19867692965084}', '存续', '91330108MA2CGK855J', '-', '', '', '2019-01-04', '零售业', '服务;供应链管理;家用电器的安装;维修;企业管理咨询;商务信息咨询;图文设计;技术开发;技术咨询;技术服务;成果转让;计算机软硬件;计算机系统集成;销售;含网上销售;服饰;日用百货;乐器;工艺礼品;珠宝首饰;黄金制品;化妆品;母婴日用品;智能家居;智能电子设备;通讯设备;办公设备;电子产品;家用电器;...国内广告', '有限责任公司外商投资企业', '10000万人民币', '', '91330108MA2CGK855J', 'MA2CGK855', '-', '杭州市高新区（滨江）市场监督管理局', null, '-', '阿里巴巴', '2020-04-03 17:10:35', '2020-04-03 20:12:51');
INSERT INTO `company` VALUES ('38', '阿里巴巴华北技术有限公司', '童文红', '天津市武清区京滨工业园京滨大道88号1号库101房间', '天津', '天津市', '武清区', '{\'lat\': 39.56060875792776, \'long\': 116.83436864555789}', '存续', '91120222MA05Y0CR4B', '120222000648184', '0571-85022088', 'gsll@service.alibaba.com', '2017-11-20', '软件和信息技术服务业', '网络技术;计算机软硬件技术;多媒体技术开发;计算机系统集成;计算机技术咨询服务;贸易咨询服务;网络运行维护', '有限责任公司', '5000万人民币', '-', '91120222MA05Y0CR4B', 'MA05Y0CR4', '-', '天津市武清区市场监督管理局', null, '-', '阿里巴巴', '2020-04-03 17:10:37', '2020-04-03 20:12:56');
INSERT INTO `company` VALUES ('39', '阿里巴巴华南技术有限公司', '童文红', '广州市海珠区广州大道南788号自编14栋之233房（仅限办公用途）', '广东', '广州市', '海珠区', '{\'lat\': 23.09540202559953, \'long\': 113.32124218195453}', '在业', '91440101MA5ALRRJ0E', '440125000363995', '0571-85022088', 'shizhou.fsz@alibaba-inc.com', '2017-11-21', '科技推广和应用服务业', '网络信息技术推广服务;通信技术研究开发;计算机网络系统工程服务;计算机技术开发;技术服务;计算机信息安全产品设计;计算机和辅助设备修理;网络安全信息咨询;网络技术的研究;开发;多媒体设计服务;信息系统集成服务;电子产品设计服务;信息技术咨询服务;信息电子技术服务;信息系统安全服务;...商品信息咨询服务', '有限责任公司', '5000万人民币', '-', '91440101MA5ALRRJ0E', 'MA5ALRRJ0', '-', '广州市海珠区工商行政管理局', null, '-', '阿里巴巴', '2020-04-03 17:10:40', '2020-04-03 20:12:54');
INSERT INTO `company` VALUES ('40', '阿里巴巴（山东）技术有限公司', '李然', '济南市历城区凤鸣路59 号鲍山大厦409室', '山东', '济南市', '历城区', '{\'lat\': 36.72209469021832, \'long\': 117.19663881874116}', '在业', '91370100MA3NCK6B1Y', '-', '0571-85022088', 'gsll@service.alibaba.com', '2018-10-15', '软件和信息技术服务业', '网络信息技术;计算机软硬件;网络技术产品;多媒体产品的开发;信息系统集成服务;计算机信息技术咨询;技术服务;网站建设;电子产品的批发;零售;机械设备维修', '有限责任公司', '5000万人民币', '', '91370100MA3NCK6B1Y', 'MA3NCK6B1', '-', '济南市市场监督管理局', null, '-', '阿里巴巴', '2020-04-03 17:10:43', '2020-04-03 20:12:59');
INSERT INTO `company` VALUES ('41', '湖南快乐阳光互动娱乐传媒有限公司', '蔡怀军', '长沙市开福区湖南国际会展中心北四楼', '湖南', '长沙市', '雨花区', '{\'lat\': 28.240622861418075, \'long\': 113.0559344498429}', '存续', '914300007880367535', '430000000085540', '0731-89662202', 'wenbin@mgtv.com', '2006-05-26', '新闻和出版业', '第二类增值电信业务中的信息服务业务;互联网杂志;互联网音像出版物;互联网游戏出版物;手机出版物经营;文化产品的销售与相关服务;数据库及计算机网络服务;计算机网络系统工程软件开发;销售;文化;体育;艺术交流活动的策划;广告制作;发布;商务代理;策划;电子产品的销售;家用电器的销售;技术研发;...仓储代理服务', '有限责任公司', '24247.0013万人民币', '24247.001万人民币', '914300007880367535', '788036753', 'Hunantv.com Interactive Entertainment Media Co.,Ltd.', '湖南省市场监督管理局', 'www.hunantv.com', '-', '芒果', '2020-04-05 16:57:02', '2020-04-05 21:42:58');
INSERT INTO `company` VALUES ('42', '青岛芒果房产经纪有限公司', '贾学雯', '山东省青岛市黄岛区隐珠街道办事处灵海路星河城一期B2栋楼1403户', '山东', '青岛市', '黄岛区', '{\'lat\': 35.90010306365372, \'long\': 120.04053976665763}', '在业', '91370211MA3D88NX69', '370211230431204', '15820033290', '13573839033@163.com', '2017-02-27', '房地产业', '房地产经纪服务;房地产营销策划;经济信息咨询;企业管理咨询;以上范围未经金融监管部门批准;均不得从事吸收存款;融资担保;代客理财等金融业务;展览展示服务;室内外装饰装潢工程设计及施工;企业营销策划;家政服务', '有限责任公司', '100万人民币', '', '91370211MA3D88NX69', 'MA3D88NX6', '-', '青岛市黄岛区市场监督管理局', null, '-', '芒果', '2020-04-05 16:57:05', '2020-04-05 21:43:05');
INSERT INTO `company` VALUES ('43', '深圳芒果网络科技有限公司', '邹先福', '深圳市龙华新区龙华街道水斗新围村67栋202', '广东', '深圳市', '龙华区', '{\'lat\': 22.641313113604273, \'long\': 114.05437331651842}', '存续', '9144030035910085XH', '440301114176341', '0755-33941570', '416259530@qq.com', '2015-10-23', '软件和信息技术服务业', '网络技术开发;电子产品的销售;通讯设备的技术开发与销售;网页设计;计算机软;硬件的研发与销售;计算机网络产品及周边设备的销售;经营电子商务;商务信息咨询;企业形象策划;国内贸易', '有限责任公司', '50万人民币', '-', '9144030035910085XH', '35910085X', '-', '深圳市市场监督管理局', 'www.mgmg.com.cn', '-', '芒果', '2020-04-05 16:57:08', '2020-04-05 21:43:24');
INSERT INTO `company` VALUES ('44', '芒果网有限公司', '范志识', '深圳市南山区后海大道2378号芒果网大厦20-22层', '广东', '深圳市', '南山区', '{\'lat\': 22.529692655259897, \'long\': 113.94190780230065}', '存续', '91440300618815105U', '440301503260902', '0755-33399999', 'rifang.he@mangocity.com', '1991-01-30', '软件和信息技术服务业', '事电脑应用软件的开发及设计;节能环保产品的研发;太阳能利用工程技术的研发;高新技术节能产品的开发;经济信息咨询和企业管理咨询;互联网应用技术;数据库应用开发技术;网络技术的开发以及销售自行开发的技术成果;货物以及技术的进出口业务;代订酒店客房;车船票;飞机票;景点门票;旅游套票;...芒果网大厦自有物业租赁', '有限责任公司港、澳、台', '51959.5万人民币', '-', '91440300618815105U', '618815105', '-', '深圳市市场监督管理局', 'www.mangocity.com.hk', '骏星电脑服务（深圳）有限公司\n芒果网（深圳）有限公司\n深圳骏星电脑服务有限公司', '芒果', '2020-04-05 16:57:10', '2020-04-05 21:43:28');
INSERT INTO `company` VALUES ('45', '辽宁芒果网络股份有限公司', '谷祖伟', '沈阳市沈河区大西路339号801室', '辽宁', '沈阳市', '沈河区', '{\'lat\': 41.797918236131785, \'long\': 123.44039295235619}', '存续', '91210103662525375T', '210100000072245', '23897777', 'n@517.cn', '2007-07-11', '软件和信息技术服务业', '互联网信息服务业务;软件设计及制作;网络技术开发服务;房屋信息咨询;房产经纪;商品房代理销售;房产营销策划;体育赛事;活动策划;金融信息咨询服务', '股份有限公司', '3000万人民币', '500万人民币', '91210103662525375T', '662525375', '-', '沈阳市市场监督管理局', 'www.517.cn', '辽宁芒果网络有限公司\n辽宁芒果传媒网络有限公司', '芒果', '2020-04-05 16:57:13', '2020-04-05 21:43:32');
INSERT INTO `company` VALUES ('46', '湖南芒果娱乐有限公司', '王柯', '长沙市开福区浏阳河大桥东金鹰影视文化城金鹰大厦主楼1903房省广播电视中心内', '湖南', '长沙市', '开福区', '{\'lat\': 28.242584634039442, \'long\': 113.05287843156675}', '存续', '914300007121944722', '430000000000302', '0731-84802289', 'xingzheng@chinaetv.com', '1999-09-02', '电信、广播电视和卫星传输服务', '广播电视节目制作经营;电视剧制作另行报批;文体活动策划;广告代理;文艺演出的策划;组织及艺人经纪;技术设备租赁;娱乐衍生产品的开发;销售;动画特效制作;新媒体;传媒的研发;运营;电子产品的销售及技术服务;电子商务信息;利用信息网络经营游戏产品;音乐娱乐产品;动漫产品;计算机技术开发;...经营增值电信业务', '有限责任公司', '4830.6424万人民币', '4830.642万人民币', '914300007121944722', '712194472', 'Hunan Mango Entertainment Co.,Ltd.', '湖南省市场监督管理局', 'www.chinaetv.com', '湖南娱乐频道文化传播有限责任公司\n湖南文体频道文化传播有限责任公司', '芒果', '2020-04-05 16:57:15', '2020-04-05 21:43:37');
INSERT INTO `company` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '阮立平', '浙江慈溪市观海卫镇广义南路12号', '浙江', '宁波市', '慈溪市', '{\'lat\': 30.16619677879674, \'long\': 121.40747365440308}', '存续', '91330200595389501Y', '330200000083194', '63908008', 'jmgxedk@163.com', '2012-06-18', '其他金融业', '办理各项贷款;办理票据贴现;小企业发展', '股份有限公司', '8000万人民币', '8000万人民币', '91330200595389501Y', '595389501', '-', '宁波市市场监督管理局', null, '-', '芒果', '2020-04-05 16:57:18', '2020-04-05 21:43:41');
INSERT INTO `company` VALUES ('48', '芒果服饰（中国）有限公司', 'MIGUEL DE LA CAPILLA BRUSTENGA', '上海市裕通路100号801-05、06单元', '上海', null, null, '{\'lat\': 31.25060600496412, \'long\': 121.46006851226609}', '存续', '91310000566582062U', '310000400640842', '18516005307', 'lv.chen@mango.com', '2011-01-12', '商务服务业', '为其提供下列服务;投资经营决策及管理的咨询服务;市场营销服务;财务管理;采购和质量监控管理;员工培训与管理;从事服装;鞋帽;配饰;装饰材料;皮革制品;塑料制品及其相关配件;包装材料;办公设备及耗材;计算机应用软件;家具及配件;衣架的零售;批发;佣金代理;进出口及相关配套业务;...提供与计算机应用软件相关的技术服务和技术咨询', '有限责任公司港、澳、台', '1330万欧元', '-', '91310000566582062U', '566582062', 'Mango Clothing(China)Co.,Ltd.', '上海市市场监督管理局', 'mango.com', '-', '芒果', '2020-04-05 16:57:20', '2020-04-05 21:43:45');
INSERT INTO `company` VALUES ('49', '芒果服饰商贸（深圳）有限公司', 'MIGUEL DE LA CAPILLA BRUSTENGA', '深圳市罗湖区人民南路嘉里中心1225单位', '广东', '深圳市', '罗湖区', '{\'lat\': 22.544052967967502, \'long\': 114.12584501812408}', '存续', '914403007883287726', '440301503311144', '0755-25181462', 'lv.chen@mango.com', '2006-06-29', '批发业', '服装;鞋帽;配饰;装饰材料;皮革制品;塑料制品及其相关配件;包装材料;办公设备及耗材;软件;家具及配件;衣架的批发;零售;零售由分支机构经营;佣金代理;进出口及相关配套业务;以上商品进出口不涉及国营贸易;出口配额招标;市场营销管理;经济信息咨询', '有限责任公司外商投资企业', '1030万欧元', '1030万欧元', '914403007883287726', '788328772', 'Mango Garments And Accessory Trading(Shenzhen)Co.,Ltd.', '深圳市市场监督管理局', null, '-', '芒果', '2020-04-05 16:57:23', '2020-04-05 21:43:49');
INSERT INTO `company` VALUES ('50', '河南金芒果印刷有限公司', '袁志宏', '郑州经济技术开发区经北二路36号', '河南', '郑州市', '郑州经济技术开发区', '{\'lat\': 34.73234809763757, \'long\': 113.75089120363955}', '存续', '914100006144111467', '410000400014062', '0371-55683610', 'jmg_8808@163.com', '1997-12-04', '印刷和记录媒介复制业', '金卡;银卡等高档纸的生产;包装材料的图文设计;制版;印刷;成型;销售及相关业务', '有限责任公司', '6000万人民币', '6000万', '914100006144111467', '614411146', 'Jinmangguo Printing Co.,Ltd.', '郑州市市场监督管理局经济技术开发区分局', 'www.jmgprinting.com', '河南豫欣烟草包装有限公司', '芒果', '2020-04-05 16:57:26', '2020-04-05 21:43:56');
INSERT INTO `company` VALUES ('51', '武汉芒果秀仕餐饮管理有限公司', '史宏建', '武昌区三角路村福星惠誉·水岸国际4号地块1栋15层1、2室', '湖北', '武汉市', '武昌区', '{\'lat\': 30.58116962618152, \'long\': 114.32841023049515}', '存续', '914201063334213642', '420106000418631', '13901706294', '13901706294@qq.com', '2015-03-06', '商务服务业', '餐饮管理;餐饮服务;仅限分公司经营;企业管理咨询;礼仪服务;食品加工技术领域内的技术开发;技术咨询;技术转让;酒店用品;厨房设备及用品;洗涤用品;日用百货的批零兼营', '有限责任公司', '374万人民币', '-', '914201063334213642', '333421364', '-', '武汉市武昌区市场监督管理局', null, '-', '芒果', '2020-04-05 16:57:28', '2020-04-05 21:44:02');
INSERT INTO `company` VALUES ('52', '成都芒果互动文化传播有限公司', '谢单', '成都市武侯区桐梓林中路8号附19号', '四川', '成都市', '武侯区', '{\'lat\': 30.620129928845174, \'long\': 104.06500093951384}', '存续', '915101076771769058', '510107000085923', '17380479676', '', '2008-07-28', '商务服务业', '策划各类文化活动;企业形象策划;企业品牌推广;市场营销策划;公关礼仪服务;企业管理咨询服务;设计;制作;发布;代理国内外各类广告;网页设计;网络设备安装与维护;计算机技术服务与技术咨询;房屋经纪', '有限责任公司', '100万人民币', '100万人民币', '915101076771769058', '677176905', 'Mango Interaction(Chengdu)Co.,Ltd', '武侯区市场和质量监督管理局', 'www.cdmango.com', '-', '芒果', '2020-04-05 16:57:31', '2020-04-05 21:44:06');
INSERT INTO `company` VALUES ('53', '重庆芒果广告传媒有限公司', '冯建国', '重庆市渝北区迎龙大道19号', '重庆', '重庆市', '渝北区', '{\'lat\': 29.816264082426493, \'long\': 106.75379853119536}', '存续', '91500000051736288N', '500900000014285', '023-86739510', '3318362374@qq.com', '2012-08-16', '商务服务业', '设计;制作;代理;发布招牌;字牌;灯箱;展示牌;霓虹灯;电子翻板装置;充气装置;电子显示屏;车载广告;代理报刊广告;影视广播广告;企业形象策划;会议及展览服务;礼仪服务;承办经批准的文化艺术交流活动;企业管理咨询;商务信息咨询;凭营业执照依法自主开展经营活动', '有限责任公司', '3000万人民币', '100万', '91500000051736288N', '051736288', 'Chongqing Mango Ad Media Co.,Ltd.', '重庆两江新区市场监督管理局', 'www.mgad.com.cn', '-', '芒果', '2020-04-05 16:57:34', '2020-04-05 21:44:14');
INSERT INTO `company` VALUES ('54', '湖南芒果粉丝旅行社有限公司', '邱光劲', '长沙市开福区德雅路314号', '湖南', '长沙市', '开福区', '{\'lat\': 28.22098499243598, \'long\': 113.00391591157496}', '存续', '914301057279412909', '430100000004184', '18907490664', '1016489113@qq.com', '2001-03-22', '商务服务业', '国内旅游业务;入境旅游业务;旅行社营业部;门市部;游览景区管理;会议及展览服务;票务服务;信息电子技术服务;老年人;残疾人养护服务', '有限责任公司', '200万人民币', '', '914301057279412909', '727941290', '-', '长沙市开福区市场监督管理局', 'www.hunantvly.com', '湖南卫视旅行社有限公司', '芒果', '2020-04-05 16:57:36', '2020-04-05 21:44:17');
INSERT INTO `company` VALUES ('55', '云南金芒果装饰工程有限公司', '周健', '云南省昆明市官渡区昌宏西路1888号', '云南', '昆明市', '官渡区', '{\'lat\': 24.997291509049628, \'long\': 102.76583410708356}', '存续', '91530111555147057M', '530111100073772', '0871-63118888', '1652605649@qq.com', '2010-06-12', '建筑装饰和其他建筑业', '室内外装饰工程设计与施工;装饰材料;建筑材料;五金交电;厨房洁具;工艺美术品的销售', '有限责任公司', '200万人民币', '200万人民币', '91530111555147057M', '555147057', '-', '官渡区市场监督管理局', 'www.jmgvip.com', '-', '芒果', '2020-04-05 16:57:39', '2020-04-05 21:44:21');
INSERT INTO `company` VALUES ('56', '上海金芒果制衣有限公司', '林晓策', '上海市宝山区上大路668号278C室', '上海', '上海市', '宝山区', '{\'lat\': 31.31714719857192, \'long\': 121.40319049690099}', '存续', '91310113744248981Q', '310113000451342', '021-56131504', '1352617047@qq.com', '2002-11-08', '纺织服装、服饰业', '服装辅料;针纺织品;皮革制品;服装鞋帽制造加工;限分支经营;销售;从事货物与技术进出口业务', '有限责任公司', '100万人民币', '100万人民币', '91310113744248981Q', '744248981', 'Shanghai Jinmangguo Clothing Manufacturing Co.,Ltd.', '宝山区市场监督管理局', 'shop110291199.taobao.com/?spm=2013.1.0.0.64b8649f6VoobA', '-', '芒果', '2020-04-05 16:57:41', '2020-04-05 21:44:28');
INSERT INTO `company` VALUES ('57', '河南金芒果地产有限公司', '裴松林', '郑州市管城回族区紫荆山路75号1号楼 10楼32号', '河南', '郑州市', '管城回族区', '{\'lat\': 34.75317372627793, \'long\': 113.68908637601002}', '存续', '91410100740744427U', '410100000005120', '0371-60126608', 'jmgdc@126.com', '2002-08-01', '房地产业', '各类房地产开发', '有限责任公司', '3000万人民币', '3000万', '91410100740744427U', '740744427', 'Henan Jinmangguo Land Property Co.,Ltd.', '郑州市市场监督管理局专业分局', null, '-', '芒果', '2020-04-05 16:57:44', '2020-04-05 21:44:31');
INSERT INTO `company` VALUES ('58', '南宁市金芒果食品有限公司', '庄泽金', '南宁市西乡塘区华西路38号大和平华西商业城4号楼2103号', '广西', '南宁市', '西乡塘区', '{\'lat\': 22.82717502157774, \'long\': 108.31500401512}', '存续', '91450107756545334W', '450107200025722', '0771-4854900', 'jinmangguo001@vip.163.com', '2004-02-18', '零售业', '销售;食品;具体项目以审批部门批准的为准;日用百货;针纺织品;鞋帽;五金交电;企业营销策划服务', '有限责任公司', '300万人民币', '300万', '91450107756545334W', '756545334', 'Nanning Jinmangguo Food Co.,Ltd.', '南宁市西乡塘区市场监督管理局', null, '-', '芒果', '2020-04-05 16:57:46', '2020-04-05 21:44:38');
INSERT INTO `company` VALUES ('59', '河南省金芒果纸制品有限公司', '李现恒', '新郑市烟厂大街', '河南', '郑州市', '新郑市', '{\'lat\': 34.38994334992948, \'long\': 113.77536436676682}', '存续', '91410184742531505Q', '410184000008925', '13849057559', 'jmgliye@163.com', '2002-09-18', '造纸和纸制品业', '纸制品生产;加工;销售', '有限责任公司', '1200万人民币', '1200万', '91410184742531505Q', '742531505', 'Xinzheng Jinmangguo Paper Products Co.,Ltd.', '新郑市市场监督管理局', null, '-', '芒果', '2020-04-05 16:57:49', '2020-04-05 21:44:42');
INSERT INTO `company` VALUES ('60', '江西金芒果装饰工程有限公司', '肖海', '江西省吉安市吉州区广场北路1号（新世界广场)1、2幢3-101门面', '江西', '吉安市', '吉州区', '{\'lat\': 27.12061838203985, \'long\': 114.99338536070974}', '存续', '91360800332932015U', '360800210027215', '0796-8868999', '376362548@qq.com', '2015-04-28', '建筑装饰和其他建筑业', '建筑装饰装修工程;室内外装饰设计;园林绿化工程;市政公用工程;水电工程;钢结构工程;建筑智能化工程;建筑装饰材料;五金交电;家用电器销售', '有限责任公司', '1000万人民币', '-', '91360800332932015U', '332932015', '-', '吉安市市场监督管理局', null, '-', '芒果', '2020-04-05 16:57:51', '2020-04-05 21:44:45');
INSERT INTO `company` VALUES ('61', '湖南芒果听见科技有限公司', '黎捷', '湖南省长沙市开福区鸭子铺路1号343房', '湖南', '长沙市', '开福区', '{\'lat\': 28.22805133091055, \'long\': 113.03538216839199}', '存续', '91430100MA4Q0HM55G', '-', '0731-84801071', 'mgtj@himango.cn', '2018-10-08', '商务服务业', '商务信息咨询;音频和视频设备租赁;娱乐设备出租服务;市场调研服务;体育设备;器材出租;场地租赁;文化活动的组织与策划;文艺表演;体育;娱乐活动的策划和组织;品牌推广营销;计算机技术开发;技术服务;文化艺术交流活动的组织;营养健康咨询服务;出版物批发;广告制作服务;发布服务;国内代理服务;...培训活动的组织', '有限责任公司', '5000万人民币', '3550万人民币', '91430100MA4Q0HM55G', 'MA4Q0HM55', '-', '长沙市市场监督管理局', 'www.tingdao.com', '-', '湖南芒果听见科技有限公司', '2020-04-05 21:31:00', '2020-04-05 21:44:51');

-- ----------------------------
-- Table structure for company2
-- ----------------------------
DROP TABLE IF EXISTS `company2`;
CREATE TABLE `company2` (
  `id` int(11) DEFAULT NULL,
  `company_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `stock_name` varchar(255) DEFAULT NULL,
  `stock_type` varchar(255) DEFAULT NULL,
  `code` varchar(255) DEFAULT NULL,
  `industry` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `chair` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `representative` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `member_number` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `final_date` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `regist_address` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `company_address` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `phone` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `fax` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `url` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `email` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `auditor` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `legal_adviser` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `main_business` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `company_info` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `date` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of company2
-- ----------------------------
INSERT INTO `company2` VALUES ('1', '腾讯控股有限公司', '腾讯控股', '港股（HK）', '00700', '电子商贸及互联网服务-  电商及互联网', '马化腾', '--', '56310', '12月31日', 'Cricket Square, Hutchins Drive, P.O.Box 2681, Grand Cayman, Cayman Islands', '香港湾仔皇后大道东1号太古广场三座29楼', '86-0755-86013388-72000;86-0755-86013388-50726', '+852 2520-1148', 'www.tencent.com', 'cosec@tencent.com;ir@tencent.com', '罗兵咸永道会计师事务所', '--', '于中国为用户提供增值服务以及网络广告服务。', '腾讯控股有限公司是一家主要提供增值服务及网络广告服务的投资控股公司。公司通过三大分部运营。增值服务分部主要包括互联网及移动平台提供的网络?手机游戏、社区增值服务及应用。网络广告分部主要包括效果广告及展示广告。其他分部主要包括支付相关服务、云服务及其他服务。', '2020-04-10');

-- ----------------------------
-- Table structure for cost
-- ----------------------------
DROP TABLE IF EXISTS `cost`;
CREATE TABLE `cost` (
  `unit` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `stock_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `code` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `selling_cost` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `selling_expenses` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `admin_expenses` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `financial_expenses` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `year` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of cost
-- ----------------------------
INSERT INTO `cost` VALUES ('元', '腾讯控股', '00700', '18207000000.00', '2994000000.00', '7766000000.00', '-488000000.00', '2012');
INSERT INTO `cost` VALUES ('元', '腾讯控股', '00700', '27778000000.00', '5695000000.00', '9988000000.00', '-1230000000.00', '2013');
INSERT INTO `cost` VALUES ('元', '腾讯控股', '00700', '30873000000.00', '7797000000.00', '14155000000.00', '-494000000.00', '2014');
INSERT INTO `cost` VALUES ('元', '腾讯控股', '00700', '41631000000.00', '7993000000.00', '16825000000.00', '-709000000.00', '2015');
INSERT INTO `cost` VALUES ('元', '腾讯控股', '00700', '67439000000.00', '12136000000.00', '22459000000.00', '-664000000.00', '2016');
INSERT INTO `cost` VALUES ('元', '腾讯控股', '00700', '120835000000.00', '17652000000.00', '33051000000.00', '-1032000000.00', '2017');
INSERT INTO `cost` VALUES ('元', '腾讯控股', '00700', '170574000000.00', '24233000000.00', '41522000000.00', '100000000.00', '2018');

-- ----------------------------
-- Table structure for economies
-- ----------------------------
DROP TABLE IF EXISTS `economies`;
CREATE TABLE `economies` (
  `stock_name` varchar(255) DEFAULT NULL,
  `code` varchar(255) DEFAULT NULL,
  `unit` varchar(255) DEFAULT NULL,
  `year` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `yingyee` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `yingyelirun` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `lirun_total` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `jinglirun` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `zichan_total` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `fuzai_total` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `quanyi_total` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of economies
-- ----------------------------
INSERT INTO `economies` VALUES ('腾讯控股', '00700', '元', '2012', '43894000000.00', '25687000000.00', '15051000000.00', '12732000000.00', '75256000000.00', '33108000000.00', '42148000000.00');
INSERT INTO `economies` VALUES ('腾讯控股', '00700', '元', '2013', '60437000000.00', '32659000000.00', '19281000000.00', '15502000000.00', '107235000000.00', '48772000000.00', '58463000000.00');
INSERT INTO `economies` VALUES ('腾讯控股', '00700', '元', '2014', '78932000000.00', '48059000000.00', '29013000000.00', '23810000000.00', '171166000000.00', '89042000000.00', '82124000000.00');
INSERT INTO `economies` VALUES ('腾讯控股', '00700', '元', '2015', '102863000000.00', '61232000000.00', '36216000000.00', '28806000000.00', '306818000000.00', '184718000000.00', '122100000000.00');
INSERT INTO `economies` VALUES ('腾讯控股', '00700', '元', '2016', '151938000000.00', '84499000000.00', '51640000000.00', '41095000000.00', '395899000000.00', '209652000000.00', '186247000000.00');
INSERT INTO `economies` VALUES ('腾讯控股', '00700', '元', '2017', '237760000000.00', '116925000000.00', '88215000000.00', '71510000000.00', '554672000000.00', '277579000000.00', '277093000000.00');
INSERT INTO `economies` VALUES ('腾讯控股', '00700', '元', '2018', '312694000000.00', '142120000000.00', '94466000000.00', '78719000000.00', '723521000000.00', '367314000000.00', '356207000000.00');

-- ----------------------------
-- Table structure for lrb
-- ----------------------------
DROP TABLE IF EXISTS `lrb`;
CREATE TABLE `lrb` (
  `stock_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `code` varchar(255) DEFAULT NULL,
  `unit` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `year` varchar(255) DEFAULT NULL,
  `pre_tax` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `after_tax` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `father_profit` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `operating_receipt` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `other_receipt` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `sales_expenses` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `manage_expenses` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `financial_expenses` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `sales_cost` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `gross_margin` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `experience_profit` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `ratio` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `net_amount1` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `net_amount2` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `premium_income` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of lrb
-- ----------------------------
INSERT INTO `lrb` VALUES ('腾讯控股', '00700', '万港元', '2019-09-30', '8489100', '7351600', '7172800', '27152200', '1605900', '1468400', '3744400', '11200', '15009700', '12142500', '8524400', '--', '--', '--', '--');
INSERT INTO `lrb` VALUES ('腾讯控股', '00700', '万港元', '2018-12-31', '9446600', '7998400', '7871900', '31269400', '1671400', '2423300', '4152200', '10000', '17057400', '14212000', '9297900', '130100', '--', '--', '--');
INSERT INTO `lrb` VALUES ('腾讯控股', '00700', '万港元', '2017-12-31', '8821500', '7247100', '7151000', '23776000', '2014000', '1765200', '3305100', '-103200', '12083500', '11692500', '8739400', '73000', '--', '--', '--');
INSERT INTO `lrb` VALUES ('腾讯控股', '00700', '万港元', '2016-12-31', '5164000', '4144700', '4109500', '15193800', '359400', '1213600', '2245900', '-66400', '6743900', '8449900', '5416200', '-254900', '--', '--', '--');
INSERT INTO `lrb` VALUES ('腾讯控股', '00700', '万港元', '2015-12-31', '3621600', '2910800', '2880600', '10286300', '188600', '799300', '1682500', '-70900', '4163100', '6123200', '3900900', '-280200', '--', '--', '--');
INSERT INTO `lrb` VALUES ('腾讯控股', '00700', '万港元', '2014-12-31', '2901300', '2388800', '2381000', '7893200', '275900', '779700', '1415500', '-49400', '3087300', '4805900', '2936000', '-34600', '--', '--', '--');
INSERT INTO `lrb` VALUES ('腾讯控股', '00700', '万港元', '2013-12-31', '1928100', '1556300', '1550200', '6043700', '90400', '569500', '998799.9', '-123000', '2777800', '3265900', '1911000', '21300', '--', '--', '--');
INSERT INTO `lrb` VALUES ('腾讯控股', '00700', '万港元', '2012-12-31', '1505100', '1278500', '1273200', '4389400', '-28400', '299400', '776600', '-48800', '1820700', '2568700', '1513100', '-5400', '--', '--', '--');

-- ----------------------------
-- Table structure for members
-- ----------------------------
DROP TABLE IF EXISTS `members`;
CREATE TABLE `members` (
  `id` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `company_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `member_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `duty` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of members
-- ----------------------------
INSERT INTO `members` VALUES ('1', '腾讯科技（北京）有限公司', '奚丹', '关联11家企业>');
INSERT INTO `members` VALUES ('1', '腾讯科技（北京）有限公司', '许晨晔', '关联12家企业>');
INSERT INTO `members` VALUES ('1', '腾讯科技（北京）有限公司', '查理瑟欧', '关联1家企业>');
INSERT INTO `members` VALUES ('1', '腾讯科技（北京）有限公司', '周昭钦', '关联39家企业>');
INSERT INTO `members` VALUES ('2', '深圳市腾讯计算机系统有限公司', '马化腾', '关联16家企业>');
INSERT INTO `members` VALUES ('2', '深圳市腾讯计算机系统有限公司', '奚丹', '关联11家企业>');
INSERT INTO `members` VALUES ('2', '深圳市腾讯计算机系统有限公司', '卢山', '关联12家企业>');
INSERT INTO `members` VALUES ('2', '深圳市腾讯计算机系统有限公司', '许晨晔', '关联12家企业>');
INSERT INTO `members` VALUES ('2', '深圳市腾讯计算机系统有限公司', '黄秋华', '关联10家企业>');
INSERT INTO `members` VALUES ('2', '深圳市腾讯计算机系统有限公司', '周昭钦', '关联39家企业>');
INSERT INTO `members` VALUES ('2', '深圳市腾讯计算机系统有限公司', '刘华', '关联2家企业>');
INSERT INTO `members` VALUES ('3', '腾讯科技（深圳）有限公司', '马化腾', '关联16家企业>');
INSERT INTO `members` VALUES ('3', '腾讯科技（深圳）有限公司', '奚丹', '关联11家企业>');
INSERT INTO `members` VALUES ('3', '腾讯科技（深圳）有限公司', 'SEARLE,CHARLESST.LEGER', '关联1家企业>');
INSERT INTO `members` VALUES ('3', '腾讯科技（深圳）有限公司', '卢山', '关联12家企业>');
INSERT INTO `members` VALUES ('3', '腾讯科技（深圳）有限公司', '周昭钦', '关联39家企业>');
INSERT INTO `members` VALUES ('4', '腾讯科技（上海）有限公司', '奚丹', '关联11家企业>');
INSERT INTO `members` VALUES ('4', '腾讯科技（上海）有限公司', '马化腾', '关联16家企业>');
INSERT INTO `members` VALUES ('4', '腾讯科技（上海）有限公司', 'CHARLESSTLEGERSEARLE', '关联2家企业>');
INSERT INTO `members` VALUES ('4', '腾讯科技（上海）有限公司', '许晨晔', '关联12家企业>');
INSERT INTO `members` VALUES ('5', '腾讯数码（天津）有限公司', '卢山', '关联12家企业>');
INSERT INTO `members` VALUES ('5', '腾讯数码（天津）有限公司', '许晨晔', '关联12家企业>');
INSERT INTO `members` VALUES ('5', '腾讯数码（天津）有限公司', 'CharlesStLegerSearle', '关联1家企业>');
INSERT INTO `members` VALUES ('6', '腾讯科技（成都）有限公司', '奚丹', '关联11家企业>');
INSERT INTO `members` VALUES ('6', '腾讯科技（成都）有限公司', 'CharlesStlegerSearle', '关联3家企业>');
INSERT INTO `members` VALUES ('6', '腾讯科技（成都）有限公司', '马化腾', '关联16家企业>');
INSERT INTO `members` VALUES ('6', '腾讯科技（成都）有限公司', '许晨晔', '关联12家企业>');
INSERT INTO `members` VALUES ('7', '淮安腾讯广告有限公司', '姚海华', '关联10家企业>');
INSERT INTO `members` VALUES ('7', '淮安腾讯广告有限公司', '毛件娥', '关联9家企业>');
INSERT INTO `members` VALUES ('8', '深圳市腾讯视频文化传播有限公司', '洪丹毅', '关联5家企业>');
INSERT INTO `members` VALUES ('8', '深圳市腾讯视频文化传播有限公司', '闫敏', '关联2家企业>');
INSERT INTO `members` VALUES ('8', '深圳市腾讯视频文化传播有限公司', '田丽', '关联15家企业>');
INSERT INTO `members` VALUES ('8', '深圳市腾讯视频文化传播有限公司', '冯明杰', '关联13家企业>');
INSERT INTO `members` VALUES ('8', '深圳市腾讯视频文化传播有限公司', '张捷', '关联7家企业>');
INSERT INTO `members` VALUES ('9', '江苏金腾讯信息技术有限公司', '何学东', '关联5家企业>');
INSERT INTO `members` VALUES ('9', '江苏金腾讯信息技术有限公司', '王震', '关联3家企业>');
INSERT INTO `members` VALUES ('10', '林芝腾讯科技有限公司', '李朝晖', '关联24家企业>');
INSERT INTO `members` VALUES ('10', '林芝腾讯科技有限公司', '湛炜标', '关联27家企业>');
INSERT INTO `members` VALUES ('10', '林芝腾讯科技有限公司', '田丽', '关联15家企业>');
INSERT INTO `members` VALUES ('10', '林芝腾讯科技有限公司', '冯明杰', '关联13家企业>');
INSERT INTO `members` VALUES ('10', '林芝腾讯科技有限公司', '刁裕云', '关联14家企业>');
INSERT INTO `members` VALUES ('11', '林芝腾讯投资管理有限公司', '李朝晖', '关联24家企业>');
INSERT INTO `members` VALUES ('11', '林芝腾讯投资管理有限公司', '湛炜标', '关联27家企业>');
INSERT INTO `members` VALUES ('11', '林芝腾讯投资管理有限公司', '田丽', '关联15家企业>');
INSERT INTO `members` VALUES ('11', '林芝腾讯投资管理有限公司', '冯明杰', '关联13家企业>');
INSERT INTO `members` VALUES ('11', '林芝腾讯投资管理有限公司', '刁裕云', '关联14家企业>');
INSERT INTO `members` VALUES ('12', '深圳市腾讯网域计算机网络有限公司', '冯明杰', '关联13家企业>');
INSERT INTO `members` VALUES ('12', '深圳市腾讯网域计算机网络有限公司', '湛炜标', '关联27家企业>');
INSERT INTO `members` VALUES ('12', '深圳市腾讯网域计算机网络有限公司', '谢兰芳', '关联7家企业>');
INSERT INTO `members` VALUES ('12', '深圳市腾讯网域计算机网络有限公司', '田丽', '关联15家企业>');
INSERT INTO `members` VALUES ('12', '深圳市腾讯网域计算机网络有限公司', '周昭钦', '关联39家企业>');
INSERT INTO `members` VALUES ('13', '腾讯数码（深圳）有限公司', '谢呼', '关联2家企业>');
INSERT INTO `members` VALUES ('13', '腾讯数码（深圳）有限公司', '刘夏耘', '关联12家企业>');
INSERT INTO `members` VALUES ('13', '腾讯数码（深圳）有限公司', '梁举', '关联3家企业>');
INSERT INTO `members` VALUES ('13', '腾讯数码（深圳）有限公司', '江波', '关联3家企业>');
INSERT INTO `members` VALUES ('13', '腾讯数码（深圳）有限公司', '周昭钦', '关联39家企业>');
INSERT INTO `members` VALUES ('14', '深圳市腾讯产业投资基金有限公司', '李朝晖', '关联24家企业>');
INSERT INTO `members` VALUES ('14', '深圳市腾讯产业投资基金有限公司', '湛炜标', '关联27家企业>');
INSERT INTO `members` VALUES ('14', '深圳市腾讯产业投资基金有限公司', '冯明杰', '关联13家企业>');
INSERT INTO `members` VALUES ('14', '深圳市腾讯产业投资基金有限公司', '田丽', '关联15家企业>');
INSERT INTO `members` VALUES ('14', '深圳市腾讯产业投资基金有限公司', '刁裕云', '关联14家企业>');
INSERT INTO `members` VALUES ('15', '深圳市腾讯产业创投有限公司', '沈丹', '关联10家企业>');
INSERT INTO `members` VALUES ('15', '深圳市腾讯产业创投有限公司', '穆亦飞', '关联12家企业>');
INSERT INTO `members` VALUES ('15', '深圳市腾讯产业创投有限公司', '黎庆杰', '关联2家企业>');
INSERT INTO `members` VALUES ('15', '深圳市腾讯产业创投有限公司', '宋嫣婷', '关联4家企业>');
INSERT INTO `members` VALUES ('16', '上海腾讯电力工程有限公司', '丁磊磊', '关联3家企业>');
INSERT INTO `members` VALUES ('16', '上海腾讯电力工程有限公司', '宣亚亚', '关联3家企业>');
INSERT INTO `members` VALUES ('17', '深圳市腾讯信达有限合伙企业（有限合伙）', '--', '--');
INSERT INTO `members` VALUES ('18', '天津腾讯网络技术有限公司', '姚星', '关联3家企业>');
INSERT INTO `members` VALUES ('18', '天津腾讯网络技术有限公司', '钟远河', '关联8家企业>');
INSERT INTO `members` VALUES ('18', '天津腾讯网络技术有限公司', '李平', '关联1家企业>');
INSERT INTO `members` VALUES ('18', '天津腾讯网络技术有限公司', '刘夏耘', '关联12家企业>');
INSERT INTO `members` VALUES ('18', '天津腾讯网络技术有限公司', '李月翠', '关联2家企业>');
INSERT INTO `members` VALUES ('19', '深圳市人保腾讯麦盛能源投资基金企业（有限合伙）', '--', '--');
INSERT INTO `members` VALUES ('20', '仪征腾讯数码有限公司', '钟远河', '关联8家企业>');
INSERT INTO `members` VALUES ('20', '仪征腾讯数码有限公司', '黄秋华', '关联10家企业>');
INSERT INTO `members` VALUES ('21', '阿里巴巴（中国）网络技术有限公司', '戴珊', '关联27家企业>');
INSERT INTO `members` VALUES ('21', '阿里巴巴（中国）网络技术有限公司', '张彧', '关联64家企业>');
INSERT INTO `members` VALUES ('21', '阿里巴巴（中国）网络技术有限公司', '蒋芳', '关联17家企业>');
INSERT INTO `members` VALUES ('21', '阿里巴巴（中国）网络技术有限公司', '冯云乐', '关联196家企业>');
INSERT INTO `members` VALUES ('22', '北京阿里巴巴云计算技术有限公司', '任庚', '关联5家企业>');
INSERT INTO `members` VALUES ('22', '北京阿里巴巴云计算技术有限公司', '司为', '关联8家企业>');
INSERT INTO `members` VALUES ('22', '北京阿里巴巴云计算技术有限公司', '秦健', '关联6家企业>');
INSERT INTO `members` VALUES ('22', '北京阿里巴巴云计算技术有限公司', '冯云乐', '关联196家企业>');
INSERT INTO `members` VALUES ('23', '淘宝（中国）软件有限公司', '张勇', '关联28家企业>');
INSERT INTO `members` VALUES ('23', '淘宝（中国）软件有限公司', '武卫', '关联14家企业>');
INSERT INTO `members` VALUES ('23', '淘宝（中国）软件有限公司', '蒋芳', '关联17家企业>');
INSERT INTO `members` VALUES ('23', '淘宝（中国）软件有限公司', '郑俊芳', '关联37家企业>');
INSERT INTO `members` VALUES ('24', '阿里巴巴（中国）有限公司', '张勇', '关联28家企业>');
INSERT INTO `members` VALUES ('24', '阿里巴巴（中国）有限公司', '武卫', '关联14家企业>');
INSERT INTO `members` VALUES ('24', '阿里巴巴（中国）有限公司', '蒋芳', '关联17家企业>');
INSERT INTO `members` VALUES ('24', '阿里巴巴（中国）有限公司', '郑俊芳', '关联37家企业>');
INSERT INTO `members` VALUES ('25', '阿里巴巴（湖北）有限公司', '钱猛', '关联1家企业>');
INSERT INTO `members` VALUES ('25', '阿里巴巴（湖北）有限公司', '徐宏', '关联26家企业>');
INSERT INTO `members` VALUES ('26', '阿里巴巴（上海）有限公司', '陶雪飞', '关联2家企业>');
INSERT INTO `members` VALUES ('26', '阿里巴巴（上海）有限公司', '和富强', '关联40家企业>');
INSERT INTO `members` VALUES ('27', '阿里巴巴丝路有限公司', '张建锋', '关联21家企业>');
INSERT INTO `members` VALUES ('27', '阿里巴巴丝路有限公司', '和富强', '关联40家企业>');
INSERT INTO `members` VALUES ('28', '阿里巴巴（山东）有限公司', '李然', '关联7家企业>');
INSERT INTO `members` VALUES ('28', '阿里巴巴（山东）有限公司', '徐宏', '关联26家企业>');
INSERT INTO `members` VALUES ('29', '阿里巴巴（河南）有限公司', '郅永宽', '关联1家企业>');
INSERT INTO `members` VALUES ('29', '阿里巴巴（河南）有限公司', '徐宏', '关联26家企业>');
INSERT INTO `members` VALUES ('30', '阿里巴巴（重庆）有限公司', '李津', '关联15家企业>');
INSERT INTO `members` VALUES ('30', '阿里巴巴（重庆）有限公司', '和富强', '关联40家企业>');
INSERT INTO `members` VALUES ('31', '阿里巴巴（江西）有限公司', '郭坤坤', '关联4家企业>');
INSERT INTO `members` VALUES ('31', '阿里巴巴（江西）有限公司', '和富强', '关联40家企业>');
INSERT INTO `members` VALUES ('32', '阿里巴巴（海南）有限公司', '和富强', '关联40家企业>');
INSERT INTO `members` VALUES ('32', '阿里巴巴（海南）有限公司', '李津', '关联15家企业>');
INSERT INTO `members` VALUES ('33', '阿里巴巴华东有限公司', '张建锋', '关联21家企业>');
INSERT INTO `members` VALUES ('33', '阿里巴巴华东有限公司', '和富强', '关联40家企业>');
INSERT INTO `members` VALUES ('34', '阿里巴巴信息港（江苏）有限公司', '周明', '关联7家企业>');
INSERT INTO `members` VALUES ('34', '阿里巴巴信息港（江苏）有限公司', '王莹', '关联1家企业>');
INSERT INTO `members` VALUES ('34', '阿里巴巴信息港（江苏）有限公司', '曹皓', '关联2家企业>');
INSERT INTO `members` VALUES ('34', '阿里巴巴信息港（江苏）有限公司', '冯云乐', '关联196家企业>');
INSERT INTO `members` VALUES ('35', '杭州阿里巴巴广告有限公司', '戴珊', '关联27家企业>');
INSERT INTO `members` VALUES ('35', '杭州阿里巴巴广告有限公司', '冯云乐', '关联196家企业>');
INSERT INTO `members` VALUES ('36', '阿里巴巴雄安技术有限公司', '张建锋', '关联21家企业>');
INSERT INTO `members` VALUES ('36', '阿里巴巴雄安技术有限公司', '和富强', '关联40家企业>');
INSERT INTO `members` VALUES ('37', '杭州阿里巴巴供应链管理有限公司', '汪海', '关联2家企业>');
INSERT INTO `members` VALUES ('37', '杭州阿里巴巴供应链管理有限公司', '冯云乐', '关联196家企业>');
INSERT INTO `members` VALUES ('38', '阿里巴巴华北技术有限公司', '童文红', '关联15家企业>');
INSERT INTO `members` VALUES ('38', '阿里巴巴华北技术有限公司', '和富强', '关联40家企业>');
INSERT INTO `members` VALUES ('39', '阿里巴巴华南技术有限公司', '童文红', '关联15家企业>');
INSERT INTO `members` VALUES ('39', '阿里巴巴华南技术有限公司', '和富强', '关联40家企业>');
INSERT INTO `members` VALUES ('40', '阿里巴巴（山东）技术有限公司', '李然', '关联7家企业>');
INSERT INTO `members` VALUES ('40', '阿里巴巴（山东）技术有限公司', '和富强', '关联40家企业>');
INSERT INTO `members` VALUES ('41', '湖南快乐阳光互动娱乐传媒有限公司', '张勇', '关联16家企业>');
INSERT INTO `members` VALUES ('41', '湖南快乐阳光互动娱乐传媒有限公司', '蔡怀军', '关联8家企业>');
INSERT INTO `members` VALUES ('41', '湖南快乐阳光互动娱乐传媒有限公司', '周雄', '关联1家企业>');
INSERT INTO `members` VALUES ('41', '湖南快乐阳光互动娱乐传媒有限公司', '丁诚', '关联3家企业>');
INSERT INTO `members` VALUES ('41', '湖南快乐阳光互动娱乐传媒有限公司', '文威', '关联1家企业>');
INSERT INTO `members` VALUES ('41', '湖南快乐阳光互动娱乐传媒有限公司', '王虎', '关联7家企业>');
INSERT INTO `members` VALUES ('42', '青岛芒果房产经纪有限公司', '贾学雯', '关联2家企业>');
INSERT INTO `members` VALUES ('42', '青岛芒果房产经纪有限公司', '徐欣', '关联2家企业>');
INSERT INTO `members` VALUES ('43', '深圳芒果网络科技有限公司', '邹先福', '关联1家企业>');
INSERT INTO `members` VALUES ('43', '深圳芒果网络科技有限公司', '邹学武', '关联2家企业>');
INSERT INTO `members` VALUES ('44', '芒果网有限公司', '范志识', '关联17家企业>');
INSERT INTO `members` VALUES ('44', '芒果网有限公司', '王红梅', '关联1家企业>');
INSERT INTO `members` VALUES ('45', '辽宁芒果网络股份有限公司', '谷祖伟', '关联12家企业>');
INSERT INTO `members` VALUES ('45', '辽宁芒果网络股份有限公司', '初阳', '关联18家企业>');
INSERT INTO `members` VALUES ('45', '辽宁芒果网络股份有限公司', '李奉来', '关联4家企业>');
INSERT INTO `members` VALUES ('45', '辽宁芒果网络股份有限公司', '韩志民', '关联2家企业>');
INSERT INTO `members` VALUES ('45', '辽宁芒果网络股份有限公司', '杨志勇', '关联7家企业>');
INSERT INTO `members` VALUES ('45', '辽宁芒果网络股份有限公司', '方笠', '关联2家企业>');
INSERT INTO `members` VALUES ('45', '辽宁芒果网络股份有限公司', '迟同来', '关联12家企业>');
INSERT INTO `members` VALUES ('45', '辽宁芒果网络股份有限公司', '姜相臣', '关联10家企业>');
INSERT INTO `members` VALUES ('46', '湖南芒果娱乐有限公司', '王柯', '关联3家企业>');
INSERT INTO `members` VALUES ('46', '湖南芒果娱乐有限公司', '王虎', '关联7家企业>');
INSERT INTO `members` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '阮立平', '关联39家企业>');
INSERT INTO `members` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '沈鸣跃', '关联1家企业>');
INSERT INTO `members` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '何航波', '关联4家企业>');
INSERT INTO `members` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '陈毅', '关联9家企业>');
INSERT INTO `members` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '方家立', '关联4家企业>');
INSERT INTO `members` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '孙平范', '关联32家企业>');
INSERT INTO `members` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '沈祖涛', '关联3家企业>');
INSERT INTO `members` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '韩宗海', '关联14家企业>');
INSERT INTO `members` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '罗建富', '关联20家企业>');
INSERT INTO `members` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '应利婉', '关联4家企业>');
INSERT INTO `members` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '蒋尧飞', '关联4家企业>');
INSERT INTO `members` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '袁实', '关联4家企业>');
INSERT INTO `members` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '蔡伟平', '关联7家企业>');
INSERT INTO `members` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '范介亭', '关联9家企业>');
INSERT INTO `members` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '邵飞', '关联1家企业>');
INSERT INTO `members` VALUES ('48', '芒果服饰（中国）有限公司', 'MIGUELDELACAPILLABRUSTENGA', '关联8家企业>');
INSERT INTO `members` VALUES ('48', '芒果服饰（中国）有限公司', 'JONATHANANDICRAIG', '关联1家企业>');
INSERT INTO `members` VALUES ('49', '芒果服饰商贸（深圳）有限公司', 'MIGUELDELACAPILLABRUSTENGA', '关联8家企业>');
INSERT INTO `members` VALUES ('49', '芒果服饰商贸（深圳）有限公司', 'JONATHANANDICRAIG', '关联1家企业>');
INSERT INTO `members` VALUES ('50', '河南金芒果印刷有限公司', '袁志宏', '关联2家企业>');
INSERT INTO `members` VALUES ('50', '河南金芒果印刷有限公司', '石国强', '关联1家企业>');
INSERT INTO `members` VALUES ('50', '河南金芒果印刷有限公司', '王志安', '关联1家企业>');
INSERT INTO `members` VALUES ('50', '河南金芒果印刷有限公司', '鲁聚慧', '关联5家企业>');
INSERT INTO `members` VALUES ('51', '武汉芒果秀仕餐饮管理有限公司', '史宏建', '关联3家企业>');
INSERT INTO `members` VALUES ('51', '武汉芒果秀仕餐饮管理有限公司', '林聪国', '关联5家企业>');
INSERT INTO `members` VALUES ('52', '成都芒果互动文化传播有限公司', '谢单', '关联5家企业>');
INSERT INTO `members` VALUES ('52', '成都芒果互动文化传播有限公司', '张艳', '关联7家企业>');
INSERT INTO `members` VALUES ('53', '重庆芒果广告传媒有限公司', '冯建国', '关联16家企业>');
INSERT INTO `members` VALUES ('53', '重庆芒果广告传媒有限公司', '李燕', '关联1家企业>');
INSERT INTO `members` VALUES ('54', '湖南芒果粉丝旅行社有限公司', '邱光劲', '关联3家企业>');
INSERT INTO `members` VALUES ('54', '湖南芒果粉丝旅行社有限公司', '杨喜梅', '关联1家企业>');
INSERT INTO `members` VALUES ('55', '云南金芒果装饰工程有限公司', '周健', '关联2家企业>');
INSERT INTO `members` VALUES ('55', '云南金芒果装饰工程有限公司', '翁正成', '关联5家企业>');
INSERT INTO `members` VALUES ('56', '上海金芒果制衣有限公司', '林晓策', '关联11家企业>');
INSERT INTO `members` VALUES ('56', '上海金芒果制衣有限公司', '林华国', '关联18家企业>');
INSERT INTO `members` VALUES ('57', '河南金芒果地产有限公司', '裴松林', '关联1家企业>');
INSERT INTO `members` VALUES ('57', '河南金芒果地产有限公司', '吴超', '关联3家企业>');
INSERT INTO `members` VALUES ('58', '南宁市金芒果食品有限公司', '庄泽金', '关联6家企业>');
INSERT INTO `members` VALUES ('58', '南宁市金芒果食品有限公司', '罗武文', '关联2家企业>');
INSERT INTO `members` VALUES ('59', '河南省金芒果纸制品有限公司', '李现恒', '关联2家企业>');
INSERT INTO `members` VALUES ('59', '河南省金芒果纸制品有限公司', '李淑娟', '关联1家企业>');
INSERT INTO `members` VALUES ('60', '江西金芒果装饰工程有限公司', '肖海', '关联2家企业>');
INSERT INTO `members` VALUES ('60', '江西金芒果装饰工程有限公司', '王子君', '关联11家企业>');
INSERT INTO `members` VALUES ('61', '湖南芒果听见科技有限公司', '胡郁', '关联27家企业>');
INSERT INTO `members` VALUES ('61', '湖南芒果听见科技有限公司', '黎捷', '关联2家企业>');
INSERT INTO `members` VALUES ('61', '湖南芒果听见科技有限公司', '张晓雪', '关联3家企业>');
INSERT INTO `members` VALUES ('61', '湖南芒果听见科技有限公司', '王玮', '关联2家企业>');
INSERT INTO `members` VALUES ('61', '湖南芒果听见科技有限公司', '牛嵩峰', '关联5家企业>');
INSERT INTO `members` VALUES ('61', '湖南芒果听见科技有限公司', '何良璋', '关联2家企业>');
INSERT INTO `members` VALUES ('61', '湖南芒果听见科技有限公司', '丁艳燕', '关联1家企业>');

-- ----------------------------
-- Table structure for paying
-- ----------------------------
DROP TABLE IF EXISTS `paying`;
CREATE TABLE `paying` (
  `﻿year` varchar(4) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `asset_ratio` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `share_ratio` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `liquidity_ratio` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `quick_ratio` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `code` varchar(255) DEFAULT NULL,
  `stock_name` varchar(255) DEFAULT NULL,
  `unit` varchar(255) DEFAULT NULL,
  `year` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of paying
-- ----------------------------
INSERT INTO `paying` VALUES ('2013', '45.48', '54.52', '1.61', '1.57', '00700', '腾讯控股', '%', '2013');
INSERT INTO `paying` VALUES ('2014', '52.02', '47.98', '1.51', '1.5', '00700', '腾讯控股', '%', '2014');
INSERT INTO `paying` VALUES ('2015', '60.2', '39.8', '1.25', '1.25', '00700', '腾讯控股', '%', '2015');
INSERT INTO `paying` VALUES ('2016', '52.96', '47.04', '1.47', '1.47', '00700', '腾讯控股', '%', '2016');
INSERT INTO `paying` VALUES ('2017', '50.04', '49.96', '1.18', '1.17', '00700', '腾讯控股', '%', '2017');
INSERT INTO `paying` VALUES ('2018', '50.77', '49.23', '1.07', '1.07', '00700', '腾讯控股', '%', '2018');

-- ----------------------------
-- Table structure for profit
-- ----------------------------
DROP TABLE IF EXISTS `profit`;
CREATE TABLE `profit` (
  `stock_name` varchar(255) DEFAULT NULL,
  `code` varchar(255) DEFAULT NULL,
  `year` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `sales` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `main` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `total` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `net` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `cunhuo` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `yingshou` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `total_week` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of profit
-- ----------------------------
INSERT INTO `profit` VALUES ('腾讯控股', '00700', '2012', '58.52', '34.47', '20.00', '30.83', '32.05', '18.65', '0.58');
INSERT INTO `profit` VALUES ('腾讯控股', '00700', '2013', '54.04', '31.62', '17.98', '26.75', '20.07', '20.45', '0.56');
INSERT INTO `profit` VALUES ('腾讯控股', '00700', '2014', '60.89', '37.20', '16.95', '29.76', '126.53', '17.20', '0.46');
INSERT INTO `profit` VALUES ('腾讯控股', '00700', '2015', '59.53', '37.92', '11.80', '24.00', '187.53', '14.57', '0.34');
INSERT INTO `profit` VALUES ('腾讯控股', '00700', '2016', '55.61', '35.65', '13.04', '23.53', '256.42', '14.97', '0.38');
INSERT INTO `profit` VALUES ('腾讯控股', '00700', '2017', '49.18', '36.76', '15.90', '27.93', '409.61', '14.37', '0.43');
INSERT INTO `profit` VALUES ('腾讯控股', '00700', '2018', '45.45', '29.73', '13.06', '24.33', '526.46', '11.00', '0.43');

-- ----------------------------
-- Table structure for shareholder_information
-- ----------------------------
DROP TABLE IF EXISTS `shareholder_information`;
CREATE TABLE `shareholder_information` (
  `id` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `member` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `proportion` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `sub_money` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `sub_date` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `real_money` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `real_date` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of shareholder_information
-- ----------------------------
INSERT INTO `shareholder_information` VALUES ('1', '腾讯科技（北京）有限公司', '添曜有限公司', '100%', '160万美元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('2', '深圳市腾讯计算机系统有限公司', '马化腾', '54.29%', '3528.5705万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('2', '深圳市腾讯计算机系统有限公司', '张志东', '22.86%', '1485.7115万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('2', '深圳市腾讯计算机系统有限公司', '许晨晔', '11.43%', '742.859万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('2', '深圳市腾讯计算机系统有限公司', '陈一丹', '11.43%', '742.859万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('3', '腾讯科技（深圳）有限公司', '中霸集团有限公司', '100%', '200万美元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('4', '腾讯科技（上海）有限公司', '中霸集团有限公司', '100%', '500万美元', '2010-08-01', '500万美元', '2010-08-01');
INSERT INTO `shareholder_information` VALUES ('5', '腾讯数码（天津）有限公司', '天宏中国有限公司', '100%', '9000万美元', '2013-03-01', '2950,50,5000,1000万美元', '2000-01-01,2008-10-07,2009-01-06,2013-04-01');
INSERT INTO `shareholder_information` VALUES ('6', '腾讯科技（成都）有限公司', '中霸集团有限公司', '100%', '22000万美元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('7', '淮安腾讯广告有限公司', '姚海华', '50.00%', '25万元', '-', '10,15万元', '2012-11-13,2013-08-05');
INSERT INTO `shareholder_information` VALUES ('7', '淮安腾讯广告有限公司', '江苏华策创意传媒有限公司', '50.00%', '25万元', '-', '10,15万元', '2012-11-13,2013-08-05');
INSERT INTO `shareholder_information` VALUES ('8', '深圳市腾讯视频文化传播有限公司', '深圳市腾讯计算机系统有限公司', '95.00%', '18050万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('8', '深圳市腾讯视频文化传播有限公司', '深圳市世纪凯旋科技有限公司', '5.00%', '950万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('9', '江苏金腾讯信息技术有限公司', '何学东', '99.00%', '495万元', '-', '495,225万元', '2010-09-19,2012-10-17');
INSERT INTO `shareholder_information` VALUES ('9', '江苏金腾讯信息技术有限公司', '南京绿如蓝生活用品有限公司', '1.00%', '5万元', '-', '5,75万元', '2010-09-19,2012-10-16');
INSERT INTO `shareholder_information` VALUES ('10', '林芝腾讯科技有限公司', '深圳市腾讯产业投资基金有限公司', '100%', '10000万元', '2020-12-31', '', '');
INSERT INTO `shareholder_information` VALUES ('11', '林芝腾讯投资管理有限公司', '深圳市腾讯产业投资基金有限公司', '100%', '10000万元', '2020-12-31', '', '');
INSERT INTO `shareholder_information` VALUES ('12', '深圳市腾讯网域计算机网络有限公司', '深圳市世纪凯旋科技有限公司', '71.00%', '710710万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('12', '深圳市腾讯网域计算机网络有限公司', '深圳市腾讯计算机系统有限公司', '29.00%', '290290万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('13', '腾讯数码（深圳）有限公司', '腾讯电商（香港）有限公司', '100%', '3000万美元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('14', '深圳市腾讯产业投资基金有限公司', '程芳', '25.00%', '47500万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('14', '深圳市腾讯产业投资基金有限公司', '陈双华', '25.00%', '47500万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('14', '深圳市腾讯产业投资基金有限公司', '沈丹', '25.00%', '47500万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('14', '深圳市腾讯产业投资基金有限公司', '李月翠', '25.00%', '47500万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('15', '深圳市腾讯产业创投有限公司', '深圳市腾讯产业投资基金有限公司', '100%', '60000万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('16', '上海腾讯电力工程有限公司', '丁一波', '99.00%', '4059万元', '2010-12-31', '', '');
INSERT INTO `shareholder_information` VALUES ('16', '上海腾讯电力工程有限公司', '宣亚亚', '1.00%', '41万元', '2010-12-31', '', '');
INSERT INTO `shareholder_information` VALUES ('17', '深圳市腾讯信达有限合伙企业（有限合伙）', '深圳市腾讯产业投资基金有限公司', '63.62%', '700291万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('17', '深圳市腾讯信达有限合伙企业（有限合伙）', '芜湖信石合力投资管理合伙企业（有限合伙）', '36.35%', '400167万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('17', '深圳市腾讯信达有限合伙企业（有限合伙）', '深圳市腾讯博远科技有限公司', '0.02%', '175万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('17', '深圳市腾讯信达有限合伙企业（有限合伙）', '信达资本管理有限公司', '0.01%', '100万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('18', '天津腾讯网络技术有限公司', '腾讯科技（北京）有限公司', '100%', '20000万元', '2030-12-31', '', '');
INSERT INTO `shareholder_information` VALUES ('19', '深圳市人保腾讯麦盛能源投资基金企业（有限合伙）', '中国人保资产管理股份有限公司', '94.90%', '949000万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('19', '深圳市人保腾讯麦盛能源投资基金企业（有限合伙）', '腾讯科技（深圳）有限公司', '4.98%', '49779.5万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('19', '深圳市人保腾讯麦盛能源投资基金企业（有限合伙）', '深圳市麦盛资产管理有限公司', '0.10%', '1000万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('19', '深圳市人保腾讯麦盛能源投资基金企业（有限合伙）', '深圳市保腾盛基金管理有限公司', '0.02%', '220.5万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('20', '仪征腾讯数码有限公司', '腾讯科技（上海）有限公司', '100%', '10000万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('21', '阿里巴巴（中国）网络技术有限公司', '淘宝（中国）软件有限公司', '50.66%', '259474万美元', '-', '-', '-');
INSERT INTO `shareholder_information` VALUES ('21', '阿里巴巴（中国）网络技术有限公司', '浙江天猫技术有限公司', '35.40%', '181347万美元', '-', '-', '-');
INSERT INTO `shareholder_information` VALUES ('21', '阿里巴巴（中国）网络技术有限公司', 'Alibaba.comChinaLimited', '13.94%', '71412万美元', '-', '100,500,800,9500,4990,5000,1500,1500,9990,4000万美元', '1999-11-03,2003-06-23,2004-10-15,2007-12-21,2010-12-02,2011-11-04,2011-12-26,2012-06-26,2012-12-18,2013-06-27');
INSERT INTO `shareholder_information` VALUES ('22', '北京阿里巴巴云计算技术有限公司', '领新有限公司', '100%', '35万美元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('23', '淘宝（中国）软件有限公司', '淘宝中国控股有限公司', '100%', '37500万美元', '-', '8700,28800万美元', '2007-03-27,2013-06-29');
INSERT INTO `shareholder_information` VALUES ('24', '阿里巴巴（中国）有限公司', 'AlibabaGroupServicesLimited', '100%', '15298万美元', '-', '10300万美元', '2010-09-08');
INSERT INTO `shareholder_information` VALUES ('25', '阿里巴巴（湖北）有限公司', '阿里巴巴（中国）有限公司', '100%', '10000万元', '2039-09-03', '', '');
INSERT INTO `shareholder_information` VALUES ('26', '阿里巴巴（上海）有限公司', '阿里巴巴（中国）有限公司', '100%', '10000万元', '2039-07-23', '', '');
INSERT INTO `shareholder_information` VALUES ('27', '阿里巴巴丝路有限公司', '阿里巴巴（中国）有限公司', '100%', '10000万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('28', '阿里巴巴（山东）有限公司', '阿里巴巴（中国）有限公司', '100%', '10000万元', '2037-03-24', '', '');
INSERT INTO `shareholder_information` VALUES ('29', '阿里巴巴（河南）有限公司', '阿里巴巴（中国）有限公司', '100%', '10000万元', '2037-03-24', '', '');
INSERT INTO `shareholder_information` VALUES ('30', '阿里巴巴（重庆）有限公司', '阿里巴巴（中国）有限公司', '100%', '10000万元', '2038-12-31', '', '');
INSERT INTO `shareholder_information` VALUES ('31', '阿里巴巴（江西）有限公司', '阿里巴巴（中国）有限公司', '100%', '10000万元', '2049-05-10', '', '');
INSERT INTO `shareholder_information` VALUES ('32', '阿里巴巴（海南）有限公司', '阿里巴巴（中国）有限公司', '100%', '10000万元', '2038-12-31', '', '');
INSERT INTO `shareholder_information` VALUES ('33', '阿里巴巴华东有限公司', '阿里巴巴（中国）有限公司', '100%', '10000万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('34', '阿里巴巴信息港（江苏）有限公司', '淘宝中国控股有限公司', '100%', '12000万美元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('35', '杭州阿里巴巴广告有限公司', '杭州臻希投资管理有限公司', '100%', '1000万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('36', '阿里巴巴雄安技术有限公司', '阿里巴巴（中国）有限公司', '100%', '10000万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('37', '杭州阿里巴巴供应链管理有限公司', '阿里巴巴（中国）网络技术有限公司', '100%', '10000万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('38', '阿里巴巴华北技术有限公司', '阿里巴巴（中国）有限公司', '100%', '5000万元', '2067-12-31', '', '');
INSERT INTO `shareholder_information` VALUES ('39', '阿里巴巴华南技术有限公司', '阿里巴巴（中国）有限公司', '100%', '5000万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('40', '阿里巴巴（山东）技术有限公司', '阿里巴巴（中国）有限公司', '100%', '5000万元', '2068-12-31', '', '');
INSERT INTO `shareholder_information` VALUES ('41', '湖南快乐阳光互动娱乐传媒有限公司', '芒果超媒股份有限公司', '100%', '24247.0013万元', '2016-06-08', '', '');
INSERT INTO `shareholder_information` VALUES ('42', '青岛芒果房产经纪有限公司', '丁桂奇', '100%', '100万元', '2067-02-28', '', '');
INSERT INTO `shareholder_information` VALUES ('43', '深圳芒果网络科技有限公司', '邹先福', '99.00%', '49.5万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('43', '深圳芒果网络科技有限公司', '邹学武', '1.00%', '0.5万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('44', '芒果网有限公司', '芒果网（投资）有限公司', '100%', '51959.5万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('45', '辽宁芒果网络股份有限公司', '2017年3月23日增资', '83.33%', '2500万元', '2018-12-31', '', '');
INSERT INTO `shareholder_information` VALUES ('45', '辽宁芒果网络股份有限公司', '谷祖伟', '10.00%', '300万元', '2020-12-31', '', '');
INSERT INTO `shareholder_information` VALUES ('45', '辽宁芒果网络股份有限公司', '沈阳必林奈尔企业管理中心（有限合伙）', '3.33%', '100万元', '2020-12-31', '', '');
INSERT INTO `shareholder_information` VALUES ('45', '辽宁芒果网络股份有限公司', '沈阳利千企业管理中心（有限合伙）', '3.33%', '100万元', '2020-12-31', '', '');
INSERT INTO `shareholder_information` VALUES ('46', '湖南芒果娱乐有限公司', '芒果超媒股份有限公司', '100%', '4830.6424万元', '2017-08-22', '', '');
INSERT INTO `shareholder_information` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '公牛集团有限公司', '30.00%', '4500万元', '-', '4500万元', '2012-06-07');
INSERT INTO `shareholder_information` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '宁波金地建设有限公司', '10.00%', '1500万元', '-', '1500万元', '2012-06-07');
INSERT INTO `shareholder_information` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '蔡伟平', '10.00%', '1500万元', '-', '1500万元', '2012-06-07');
INSERT INTO `shareholder_information` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '宁波裕人投资有限公司', '7.00%', '1050万元', '-', '1050万元', '2012-06-07');
INSERT INTO `shareholder_information` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '浙江富迩佳电子科技有限公司', '7.00%', '1050万元', '-', '1050万元', '2012-06-07');
INSERT INTO `shareholder_information` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '宁波海飞电器有限公司', '6.00%', '900万元', '-', '900万元', '2012-06-07');
INSERT INTO `shareholder_information` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '宁波拓贸隆电子科技有限公司', '5.00%', '750万元', '-', '750万元', '2012-06-07');
INSERT INTO `shareholder_information` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '慈溪市飞马包装印刷有限公司', '5.00%', '750万元', '-', '750万元', '2012-06-07');
INSERT INTO `shareholder_information` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '慈溪市一栋电子有限公司', '5.00%', '750万元', '-', '750万元', '2012-06-07');
INSERT INTO `shareholder_information` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '浙江冬宫电缆有限公司', '5.00%', '750万元', '-', '750万元', '2012-06-07');
INSERT INTO `shareholder_information` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '慈溪市顺达实业有限公司', '5.00%', '750万元', '-', '750万元', '2012-06-07');
INSERT INTO `shareholder_information` VALUES ('47', '慈溪市金芒果小额贷款股份有限公司', '宁波吉毅电器有限公司', '5.00%', '750万元', '-', '750万元', '2012-06-07');
INSERT INTO `shareholder_information` VALUES ('48', '芒果服饰（中国）有限公司', '芒果香港有限公司', '100%', '1330万欧元', '2014-02-27', '114,456,160,800,400万欧元', '2011-03-08,2011-09-13,2012-08-10,2012-11-26,2013-12-24');
INSERT INTO `shareholder_information` VALUES ('49', '芒果服饰商贸（深圳）有限公司', 'PUNTOFASL', '100%', '1030万欧元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('50', '河南金芒果印刷有限公司', '河南中烟工业有限责任公司', '70.00%', '4200万元', '1998-05-08', '4200万元', '1998-05-08');
INSERT INTO `shareholder_information` VALUES ('50', '河南金芒果印刷有限公司', '郑州黄金叶实业总公司', '14.00%', '840万元', '1998-05-08', '840万元', '1998-05-08');
INSERT INTO `shareholder_information` VALUES ('50', '河南金芒果印刷有限公司', '洛阳烟草服务中心', '8.00%', '480万元', '1998-05-08', '480万元', '1998-05-08');
INSERT INTO `shareholder_information` VALUES ('50', '河南金芒果印刷有限公司', '安阳市红旗渠集团', '8.00%', '480万元', '1998-05-08', '480万元', '1998-05-08');
INSERT INTO `shareholder_information` VALUES ('51', '武汉芒果秀仕餐饮管理有限公司', '马超杰', '62.03%', '232万元', '2020-03-02', '', '');
INSERT INTO `shareholder_information` VALUES ('51', '武汉芒果秀仕餐饮管理有限公司', '李群', '21.39%', '80万元', '2020-03-02', '', '');
INSERT INTO `shareholder_information` VALUES ('51', '武汉芒果秀仕餐饮管理有限公司', '刘鹏', '10.70%', '40万元', '2020-03-02', '', '');
INSERT INTO `shareholder_information` VALUES ('51', '武汉芒果秀仕餐饮管理有限公司', '程勇', '2.83%', '10.6万元', '2020-03-02', '', '');
INSERT INTO `shareholder_information` VALUES ('51', '武汉芒果秀仕餐饮管理有限公司', '张武斌', '1.02%', '3.8万元', '2020-03-02', '', '');
INSERT INTO `shareholder_information` VALUES ('51', '武汉芒果秀仕餐饮管理有限公司', '林聪国', '1.02%', '3.8万元', '2020-03-02', '', '');
INSERT INTO `shareholder_information` VALUES ('51', '武汉芒果秀仕餐饮管理有限公司', '陈菁菁', '1.02%', '3.8万元', '2020-03-02', '', '');
INSERT INTO `shareholder_information` VALUES ('52', '成都芒果互动文化传播有限公司', '谢单', '60.00%', '60万元', '2008-10-27', '30万元', '2008-09-01');
INSERT INTO `shareholder_information` VALUES ('52', '成都芒果互动文化传播有限公司', '张艳', '40.00%', '40万元', '2008-10-27', '40万元', '2008-09-01');
INSERT INTO `shareholder_information` VALUES ('53', '重庆芒果广告传媒有限公司', '华商智汇传媒股份有限公司', '100%', '3000万元', '2046-12-31', '', '');
INSERT INTO `shareholder_information` VALUES ('54', '湖南芒果粉丝旅行社有限公司', '邱光劲', '65.00%', '130万元', '2031-03-20', '80万元', '2011-04-21');
INSERT INTO `shareholder_information` VALUES ('54', '湖南芒果粉丝旅行社有限公司', '杨喜梅', '35.00%', '70万元', '-', '70万元', '2011-04-21');
INSERT INTO `shareholder_information` VALUES ('55', '云南金芒果装饰工程有限公司', '周健', '40.50%', '81万元', '2010-06-11', '81万元', '2010-06-11');
INSERT INTO `shareholder_information` VALUES ('55', '云南金芒果装饰工程有限公司', '翁正成', '36.50%', '73万元', '2010-06-11', '73万元', '2010-06-11');
INSERT INTO `shareholder_information` VALUES ('55', '云南金芒果装饰工程有限公司', '王华松', '23.00%', '46万元', '2010-06-11', '46万元', '2010-06-11');
INSERT INTO `shareholder_information` VALUES ('56', '上海金芒果制衣有限公司', '林晓策', '80.00%', '80万元', '2002-11-08', '80万元', '2009-11-18');
INSERT INTO `shareholder_information` VALUES ('56', '上海金芒果制衣有限公司', '林华国', '20.00%', '20万元', '2002-11-08', '20万元', '2009-11-18');
INSERT INTO `shareholder_information` VALUES ('57', '河南金芒果地产有限公司', '路通', '66.67%', '2000万元', '2004-04-23', '', '');
INSERT INTO `shareholder_information` VALUES ('57', '河南金芒果地产有限公司', '张青花', '33.33%', '1000万元', '2004-04-23', '', '');
INSERT INTO `shareholder_information` VALUES ('58', '南宁市金芒果食品有限公司', '庄泽金', '80.00%', '240万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('58', '南宁市金芒果食品有限公司', '罗武文', '20.00%', '60万元', '-', '', '');
INSERT INTO `shareholder_information` VALUES ('59', '河南省金芒果纸制品有限公司', '李现恒', '66.67%', '800万元', '2011-07-20', '800万元', '2011-07-20');
INSERT INTO `shareholder_information` VALUES ('59', '河南省金芒果纸制品有限公司', '李淑娟', '33.33%', '400万元', '2011-07-20', '400万元', '2011-07-20');
INSERT INTO `shareholder_information` VALUES ('60', '江西金芒果装饰工程有限公司', '肖海', '35.00%', '350万元', '2055-04-28', '', '');
INSERT INTO `shareholder_information` VALUES ('60', '江西金芒果装饰工程有限公司', '王子君', '25.00%', '250万元', '2055-04-28', '', '');
INSERT INTO `shareholder_information` VALUES ('60', '江西金芒果装饰工程有限公司', '朱敏', '20.00%', '200万元', '2055-04-28', '', '');
INSERT INTO `shareholder_information` VALUES ('60', '江西金芒果装饰工程有限公司', '于涵', '20.00%', '200万元', '2055-04-28', '', '');
INSERT INTO `shareholder_information` VALUES ('61', '湖南芒果听见科技有限公司', '湖南广播电视台广播传媒中心', '36.00%', '1800万元', '2038-09-05', '', '');
INSERT INTO `shareholder_information` VALUES ('61', '湖南芒果听见科技有限公司', '科大讯飞股份有限公司', '35.00%', '1750万元', '2038-09-05', '', '');
INSERT INTO `shareholder_information` VALUES ('61', '湖南芒果听见科技有限公司', '湖南马栏山芒果听见创业投资基金合伙企业（有限合伙）', '29.00%', '1450万元', '2038-09-05', '', '');

-- ----------------------------
-- Table structure for stock
-- ----------------------------
DROP TABLE IF EXISTS `stock`;
CREATE TABLE `stock` (
  `﻿id` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `code` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `nice_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `company_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `date` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `text` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `money_report` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `type` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `main_business` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of stock
-- ----------------------------
INSERT INTO `stock` VALUES ('1', '00700', '腾讯控股', '腾讯控股有限公司', '2004-06-16', '--', null, '电商及互联网', '于中国为用户提供增值服务以及网络广告服务。');

-- ----------------------------
-- Table structure for users
-- ----------------------------
DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `username` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `tel` bigint(20) DEFAULT NULL,
  `nickname` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `token` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of users
-- ----------------------------
INSERT INTO `users` VALUES ('admin', '123456', '2271173295@qq.com', '18867418393', '雨季不再来', 'admin');
INSERT INTO `users` VALUES ('admin2', '456789', '123456789@qq.com', '15580219942', '张三', 'admin2');

-- ----------------------------
-- Table structure for website
-- ----------------------------
DROP TABLE IF EXISTS `website`;
CREATE TABLE `website` (
  `id` int(11) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `url` varchar(255) DEFAULT NULL,
  `introdution` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of website
-- ----------------------------
INSERT INTO `website` VALUES ('1', '天眼查', 'https://www.tianyancha.com/vipintro/?jsid=SEM-BAIDU-PZ2003-VI-000001', '国家中小企业发展基金旗下，提供从公司工商信息查询到工商注册、财税代办等服务，2亿用户都在用');
INSERT INTO `website` VALUES ('2', '企查查', 'https://www.qcc.com/', '人民银行备案企业征信机构，2亿用户都在查的APP。基于完全公开的全国工商信息、诉讼信息、知识产权信息等维度，为用户提供免费的一站式查询服务。通过对数据的深度分析，挖掘企业、高管之间的关联关系，帮助普通用户详实了解合作公司，预防潜在风险');
INSERT INTO `website` VALUES ('3', '启信宝', 'https://www.qixin.com/', '为您提供全国企业信用信息查询服务,包括企业注册信息查询、企业工商信息查询、企业信用查询、企业信息查询等相关信息查询!还可以深入了解企业相关的法人股东,企业征信,企业对外投资及任职等各种信息!启信宝帮助您及时全面了解企业经营和人员投资状况');
INSERT INTO `website` VALUES ('4', '东方财富网', 'https://www.eastmoney.com/', '专业的互联网财经媒体，提供7*24小时财经资讯及全球金融市场报价，汇聚全方位的综合财经资讯和金融市场资讯，覆盖股票、财经、证券、金融、美股、港股、行情、基金、债券、期货、外汇、科创板、保险、信托、黄金、理财、商业、银行、博客、股吧、财迷、论坛等财经综合信息');
INSERT INTO `website` VALUES ('5', '网易财经', 'https://money.163.com/', '新闻报道以内容整合、网友互动、主动出击为核心链条，为网友提供宏观、股票、商业、理财等财经领域的终结式报道；依托网易强大的的技术优势，提供实时的全球金融市场数据更新和实时解读，并提供操盘建议，挖掘投资机会');
INSERT INTO `website` VALUES ('6', '新浪财经', 'https://finance.sina.com.cn/', '新浪财经提供7X24小时财经资讯及全球金融市场报价，覆盖股票、债券、基金、期货、信托、理财、管理等多种面向个人和企业的服务');

-- ----------------------------
-- Table structure for xjllb
-- ----------------------------
DROP TABLE IF EXISTS `xjllb`;
CREATE TABLE `xjllb` (
  `stock_name` varchar(11) DEFAULT NULL,
  `unit` varchar(255) DEFAULT NULL,
  `code` varchar(255) DEFAULT NULL,
  `year` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `cash_net_amount1` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `cash_net_amount2` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `cash_net_amount3` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `cash_add_amount1` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `cash_balance` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `alter_affect` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `cash_balance_amount` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of xjllb
-- ----------------------------
INSERT INTO `xjllb` VALUES ('腾讯控股', '万港元', '00700', '2019/9/30', '9798600', '-5638200', '420700', '4581100', '9781400', '198200', '14560700');
INSERT INTO `xjllb` VALUES ('腾讯控股', '万港元', '00700', '2018/12/31', '10644300', '-15191300', '3538000', '-1009000', '10569700', '220700', '9781400');
INSERT INTO `xjllb` VALUES ('腾讯控股', '万港元', '00700', '2017/12/31', '10614000', '-9639200', '2659800', '3634600', '7190200', '-255100', '10569700');
INSERT INTO `xjllb` VALUES ('腾讯控股', '万港元', '00700', '2016/12/31', '6551800', '-7092300', '3144300', '2603800', '4343800', '242600', '7190200');
INSERT INTO `xjllb` VALUES ('腾讯控股', '万港元', '00700', '2015/12/31', '4543100', '-6360500', '1852800', '35400', '4271300', '37100', '4343800');
INSERT INTO `xjllb` VALUES ('腾讯控股', '万港元', '00700', '2014/12/31', '3271100', '-2838800', '1835000', '2267300', '2022800', '-18800', '4271300');
INSERT INTO `xjllb` VALUES ('腾讯控股', '万港元', '00700', '2013/12/31', '2437400', '-1913400', '170800', '694799.9', '1338300', '-10300', '2022800');
INSERT INTO `xjllb` VALUES ('腾讯控股', '万港元', '00700', '2012/12/31', '1942900', '-1627000', '-238600', '77300', '1261200', '-200', '1338300');

-- ----------------------------
-- Table structure for zcfzb
-- ----------------------------
DROP TABLE IF EXISTS `zcfzb`;
CREATE TABLE `zcfzb` (
  `stock_name` varchar(255) DEFAULT NULL,
  `code` int(255) DEFAULT NULL,
  `unit` varchar(255) DEFAULT NULL,
  `year` varchar(255) DEFAULT NULL,
  `zichan_total` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `fuzai_total` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `quanyi_total` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `shebei` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `cunhuo` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `yingshou_amount` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `jiaoyi` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `cash_thing` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `liudong_total` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `yingfu_amount` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `yingjiao_amount` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `liudongfuzai_total` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `feiliudongfuzai_total` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `mother` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of zcfzb
-- ----------------------------
INSERT INTO `zcfzb` VALUES ('腾讯控股', '700', '万港元', '2019-09-30', '85622200', '41468500', '44153700', '4310400', '41200', '3206900', '--', '14560700', '25996500', '8186900', '1145400', '21152400', '20316100', '40398200');
INSERT INTO `zcfzb` VALUES ('腾讯控股', '700', '万港元', '2018-12-31', '72352100', '36731400', '35620700', '3509100', '32400', '2842700', '--', '9781400', '21708000', '8745500', '1125900', '20243500', '16487900', '32351000');
INSERT INTO `zcfzb` VALUES ('腾讯控股', '700', '万港元', '2017-12-31', '55467200', '27757900', '27709300', '2359700', '29500', '1654900', '--', '10569700', '17844600', '5483700', '964200', '15174000', '12583900', '25607400');
INSERT INTO `zcfzb` VALUES ('腾讯控股', '700', '万港元', '2016-12-31', '39589900', '20965200', '18624700', '1390000', '26300', '1015200', '--', '7190200', '14915400', '3087900', '596400', '10119700', '10845500', '17462400');
INSERT INTO `zcfzb` VALUES ('腾讯控股', '700', '万港元', '2015-12-31', '30681800', '18471800', '12210000', '997300', '22200', '706100', '--', '4343800', '15537800', '1958600', '207000', '12440600', '6031200', '12003500');
INSERT INTO `zcfzb` VALUES ('腾讯控股', '700', '万港元', '2014-12-31', '17116600', '8904200', '8212400', '791800', '24400', '458800', '--', '4271300', '7532100', '1051700', '102700', '5003500', '3900700', '8001300');
INSERT INTO `zcfzb` VALUES ('腾讯控股', '700', '万港元', '2013-12-31', '10723500', '4877200', '5846300', '869300', '138400', '295500', '--', '2022800', '5368600', '668000', '191100', '3326700', '1550500', '5794500');
INSERT INTO `zcfzb` VALUES ('腾讯控股', '700', '万港元', '2012-12-31', '7525600', '3310800', '4214800', '740299.9', '56800', '235400', '--', '1338300', '3650900', '421200', '96000', '2066500', '1244300', '4129800');
